its-lit.org
:PROPERTIES:
:TOC:      :include siblings :depth 1 :force (depth) :ignore (this) :local (nothing)
:END:
#+title: John's Emacs Configuration
#+subtitle: And scattered esoterica to help my future self
#+author: John Sperger
#+language: en
#+options: toc:2
#+startup: show2levels
# macros taken from prot's config https://git.sr.ht/~protesilaos/dotfiles
#+macro: latest-export-date (eval (format-time-string "%F %T %z"))
#+macro: word-count (eval (count-words (point-min) (point-max)))

*Last revised and exported on {{{latest-export-date}}} with a word
count of {{{word-count}}}.*
* Overview
:PROPERTIES:
:LAST_MODIFIED: [2025-07-16 Wed 00:42]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:TOC:  :include siblings :force (nothing) :ignore (nothing) :local (nothing) :depth 2
:CUSTOM_ID: overview
:END:
:CONTENTS:
- [[#overview][Overview]]
  - [[#style][Style]]
  - [[#design-decisions--notable-features][Design Decisions & Notable Features]]
    - [[#support-for-detangling-excluding-headerfooter][Support for detangling (excluding header/footer)]]
    - [[#aggressive-time-stamping][Aggressive time-stamping]]
  - [[#warnings][Warnings]]
    - [[#i-have-no-idea-what-im-doing][I have no idea what I'm doing]]
    - [[#i-dont-care-about-startup-time-or-at-least-dont-optimize-for-it][I don't care about startup time (or at least don't optimize for it)]]
  - [[#lisp-helpers-for-maintaining-my-literate-config][Lisp helpers for maintaining my literate config]]
- [[#detailed-outline][Detailed Outline]]
- [[#notes-on-configuring-emacs][Notes on configuring Emacs]]
  - [[#things-i-found-or-continue-to-find-particularly-confusing][Things I found or continue to find particularly confusing]]
  - [[#notes-while-figuring-out-how-to-make-header-and-footer-templates][Notes while figuring out how to make header and footer templates]]
- [[#emacs-user-directory-files-init-and-early-init][Emacs user directory files (init and early-init)]]
  - [[#initel][init.el]]
- [[#config-directory-for-non-byte-copiled-files][Config directory for non-byte-copiled files]]
  - [[#one-stop-keybinding-shop][One stop keybinding shop]]
  - [[#bibliography-management][Bibliography management]]
  - [[#configure-base-emacs-options-and-built-in-packages][Configure base emacs options and built-in packages]]
  - [[#setup-coreel][setup-core.el]]
  - [[#configure-all-things-org-mode][Configure all things org mode]]
  - [[#configure-programming-language-specific-options][Configure (programming) language-specific options]]
  - [[#configure-theming][Configure Theming]]
  - [[#setup-comment-toolsel][setup-comment-tools.el]]
  - [[#configure-completion-frameworks][Configure completion frameworks]]
  - [[#setup-data-formatsel][setup-data-formats.el]]
  - [[#setup-denoteel][setup-denote.el]]
  - [[#setup-diagrammingel][setup-diagramming.el]]
  - [[#setup-eafel][setup-eaf.el]]
  - [[#configure-editor-utility-packages][Configure editor utility packages]]
  - [[#setup-emacsel][setup-emacs.el]]
  - [[#setup-emailel][setup-email.el]]
  - [[#setup-evil-addonsel][setup-evil-addons.el]]
  - [[#setup-evilel][setup-evil.el]]
  - [[#setup-font-lockingel][setup-font-locking.el]]
  - [[#setup-goel][setup-go.el]]
  - [[#setup-gopherel][setup-gopher.el]]
  - [[#setup-help-and-documentation-viewers][Setup help and documentation viewers]]
  - [[#setup-iconsel][setup-icons.el]]
  - [[#setup-lispel][setup-lisp.el]]
  - [[#setup-llmel][setup-llm.el]]
  - [[#setup-lsp-bridgeel][setup-lsp-bridge.el]]
  - [[#setup-lspel][setup-lsp.el]]
  - [[#setup-markdownel][setup-markdown.el]]
  - [[#setup-mediael][setup-media.el]]
  - [[#setup-modelineel][setup-modeline.el]]
  - [[#setup-notesel][setup-notes.el]]
  - [[#outline-and-fold-text][Outline and fold text]]
  - [[#setup-programmingel][setup-programming.el]]
  - [[#setup-projectsel][setup-projects.el]]
  - [[#setup-readingel][setup-reading.el]]
  - [[#setup-searchel][setup-search.el]]
  - [[#setup-snippetsel][setup-snippets.el]]
  - [[#setup-treesitel][setup-treesit.el]]
  - [[#configure-ui-elements][Configure UI Elements]]
  - [[#setup-uiel][setup-ui.el]]
  - [[#setup-vcel][setup-vc.el]]
  - [[#setup-webel][setup-web.el]]
  - [[#setup-writingel][setup-writing.el]]
- [[#lisp-functions][Lisp functions]]
  - [[#my-core-functionsel][my-core-functions.el]]
  - [[#my-core-helpersel][my-core-helpers.el]]
  - [[#my-editor-helpersel][my-editor-helpers.el]]
  - [[#my-keybinding-helpersel][my-keybinding-helpers.el]]
  - [[#my-lang-helpersel][my-lang-helpers.el]]
  - [[#my-lsp-bridge-helpersel][my-lsp-bridge-helpers.el]]
  - [[#my-org-helpersel][my-org-helpers.el]]
  - [[#my-theme-helpersel][my-theme-helpers.el]]
  - [[#my-vc-helpersel][my-vc-helpers.el]]
- [[#appendices][Appendices]]
:END:

This file documents and generates my Emacs configuration. It tangles to create
my configuration files; this is distinct from the kind of literate config that
uses the org file as the config file.

** Style
:PROPERTIES:
:CUSTOM_ID: style
:LAST_MODIFIED: [2025-07-19 Sat 19:10]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

Headings in the sections containing configuration code are functional as well as
organizational. 
#+name: Heading structure
| Level   | Usage                                                |
|---------+------------------------------------------------------|
| H1 ~*~    | Organization; Tangle to distinct directories         |
| H2 ~**~   | Each header at this level tangles to a distinct file |
| H3+ ~***~ | Finer-grained control of time stamping, header args  |
|         |                                                      |

** Design Decisions & Notable Features
:PROPERTIES:
:CUSTOM_ID: design-decisions--notable-features
:END:
*** Support for detangling (excluding header/footer)
:PROPERTIES:
:CUSTOM_ID: support-for-detangling-excluding-headerfooter
:LAST_MODIFIED: [2025-07-19 Sat 19:15]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

The header option =:comments noweb= encases the code in the tangled file with a
comment linking back to the org source block. This enables detangling; you can
edit elisp files and backpropogate the changes to this org file. Not sure if this will be a good idea or if it's just an invitation for the config to get out of sync.

**** Headers and footers
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 19:32]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

Detangling relies on magic comments that are inserted in the tangled file to
link them back to a src block in the org file. The contents of the src block get
encased by comment lines (automatically adjusted to the language of the block)
like:

#+begin_src emacs-lisp :eval no results: asis :noweb no
;; [[file:its-lit.org::{src block}][{src block}]]
...
;; {src block} ends here
#+end_src

This presents a problem for the header of lisp files with a lexical binding
directive:
#+begin_src emacs-lisp :eval no results: asis :noweb no
-*- lexical-binding: t -*-
#+end_src

I spent a bit of time trying to automagically add these but ultimately gave up
for now. The workaround is very simple, manual header and footer blocks with
=:comments no= added to the header arugments:

#+name: Example header
#+begin_src org
,#+begin_src emacs-lisp :comments no
;;; {file}.el --- short description -*- lexical-binding: t; -*-
;;; Commentary:
;;; Code:
,#+end_src
#+end_src

#+name: Example footer
#+begin_src org
,#+begin_src emacs-lisp :comments no
;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; configure-{file} ends here
,#+end_src
#+end_src

Because they're so boiler plate I wanted to write a function that would print
them automatically based on the tangle destination + a user-supplied argument
for the short description. 
A simple solution with just the directive and no other info would be easiest with a post-tangle hook, but I want more functionality like including the filename and short description in the first line. Maybe someday, but for now just need to be disciplined about editing the org file not the indvidual lisp files. Maybe someday... [[#notes-header-and-footer-templates][maybe someday
]]
*** Aggressive time-stamping
:PROPERTIES:
:CUSTOM_ID: aggressive-time-stamping
:LAST_MODIFIED: [2025-07-19 Sat 19:33]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
The combination of scavenging snippets from a multitude of dotfiles, tending
towards maximalism in package usage, Emacs's long history and ongoing
development, and starting to configure Emacs before I had any idea what I was
doing combine to make certain configuration options obsolete over time.

You'll encounter snippets that have been passed around since time immemorial
(the early-init garbage collector trick is a notable one that still seems to
have utility even if it's just saving fractions of a second).

** Warnings
:PROPERTIES:
:CUSTOM_ID: warnings
:END:
*** I have no idea what I'm doing
:PROPERTIES:
:CUSTOM_ID: i-have-no-idea-what-im-doing
:END:
*** I don't care about startup time (or at least don't optimize for it)
:PROPERTIES:
:CUSTOM_ID: i-dont-care-about-startup-time-or-at-least-dont-optimize-for-it
:END:
This config is meant to be used with Emacs running as a daemon. When I want to
open Emacs I'm really calling ~emacsclient~ with an option to create a new frame.
When I "quit" emacs I just delete the current frame. The initialization is far
from optimized because I only have to wait for it if I'm debugging some part of
my configuration. 

I'm sympathetic to the arguments in this blog post that [[https://batsov.com/articles/2025/04/07/emacs-startup-time-does-not-matter/][start-up time doesn't matter]] (to me). 

** Lisp helpers for maintaining my literate config
:PROPERTIES:
:header-args: :tangle no
:CUSTOM_ID: lisp-helpers-for-maintaining-my-literate-config
:LAST_MODIFIED: [2025-07-18 Fri 21:37]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

Work in progress



* Detailed Outline
:PROPERTIES:
:TOC:      :include all :depth 3 :force (nothing) :ignore (nothing) :local (nothing)
:CUSTOM_ID: detailed-outline
:LAST_MODIFIED: [2025-07-19 Sat 20:40]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
:CONTENTS:
- [[#overview][Overview]]
  - [[#style][Style]]
  - [[#design-decisions--notable-features][Design Decisions & Notable Features]]
    - [[#support-for-detangling-excluding-headerfooter][Support for detangling (excluding header/footer)]]
    - [[#aggressive-time-stamping][Aggressive time-stamping]]
  - [[#warnings][Warnings]]
    - [[#i-have-no-idea-what-im-doing][I have no idea what I'm doing]]
    - [[#i-dont-care-about-startup-time-or-at-least-dont-optimize-for-it][I don't care about startup time (or at least don't optimize for it)]]
  - [[#lisp-helpers-for-maintaining-my-literate-config][Lisp helpers for maintaining my literate config]]
- [[#detailed-outline][Detailed Outline]]
- [[#notes-on-configuring-emacs][Notes on configuring Emacs]]
  - [[#things-i-found-or-continue-to-find-particularly-confusing][Things I found or continue to find particularly confusing]]
  - [[#notes-while-figuring-out-how-to-make-header-and-footer-templates][Notes while figuring out how to make header and footer templates]]
- [[#emacs-user-directory-files-init-and-early-init][Emacs user directory files (init and early-init)]]
  - [[#initel][init.el]]
- [[#config-directory-for-non-byte-copiled-files][Config directory for non-byte-copiled files]]
  - [[#one-stop-keybinding-shop][One stop keybinding shop]]
  - [[#bibliography-management][Bibliography management]]
  - [[#configure-base-emacs-options-and-built-in-packages][Configure base emacs options and built-in packages]]
  - [[#setup-coreel][setup-core.el]]
  - [[#configure-all-things-org-mode][Configure all things org mode]]
  - [[#configure-programming-language-specific-options][Configure (programming) language-specific options]]
  - [[#configure-theming][Configure Theming]]
  - [[#setup-comment-toolsel][setup-comment-tools.el]]
  - [[#configure-completion-frameworks][Configure completion frameworks]]
  - [[#setup-data-formatsel][setup-data-formats.el]]
  - [[#setup-denoteel][setup-denote.el]]
  - [[#setup-diagrammingel][setup-diagramming.el]]
  - [[#setup-eafel][setup-eaf.el]]
  - [[#configure-editor-utility-packages][Configure editor utility packages]]
  - [[#setup-emacsel][setup-emacs.el]]
  - [[#setup-emailel][setup-email.el]]
  - [[#setup-evil-addonsel][setup-evil-addons.el]]
  - [[#setup-evilel][setup-evil.el]]
  - [[#setup-font-lockingel][setup-font-locking.el]]
  - [[#setup-goel][setup-go.el]]
  - [[#setup-gopherel][setup-gopher.el]]
  - [[#setup-help-and-documentation-viewers][Setup help and documentation viewers]]
  - [[#setup-iconsel][setup-icons.el]]
  - [[#setup-lispel][setup-lisp.el]]
  - [[#setup-llmel][setup-llm.el]]
  - [[#setup-lsp-bridgeel][setup-lsp-bridge.el]]
  - [[#setup-lspel][setup-lsp.el]]
  - [[#setup-markdownel][setup-markdown.el]]
  - [[#setup-mediael][setup-media.el]]
  - [[#setup-modelineel][setup-modeline.el]]
  - [[#setup-notesel][setup-notes.el]]
  - [[#outline-and-fold-text][Outline and fold text]]
  - [[#setup-programmingel][setup-programming.el]]
  - [[#setup-projectsel][setup-projects.el]]
  - [[#setup-readingel][setup-reading.el]]
  - [[#setup-searchel][setup-search.el]]
  - [[#setup-snippetsel][setup-snippets.el]]
  - [[#setup-treesitel][setup-treesit.el]]
  - [[#configure-ui-elements][Configure UI Elements]]
  - [[#setup-uiel][setup-ui.el]]
  - [[#setup-vcel][setup-vc.el]]
  - [[#setup-webel][setup-web.el]]
  - [[#setup-writingel][setup-writing.el]]
- [[#lisp-functions][Lisp functions]]
  - [[#my-core-functionsel][my-core-functions.el]]
  - [[#my-core-helpersel][my-core-helpers.el]]
  - [[#my-editor-helpersel][my-editor-helpers.el]]
  - [[#my-keybinding-helpersel][my-keybinding-helpers.el]]
  - [[#my-lang-helpersel][my-lang-helpers.el]]
  - [[#my-lsp-bridge-helpersel][my-lsp-bridge-helpers.el]]
  - [[#my-org-helpersel][my-org-helpers.el]]
  - [[#my-theme-helpersel][my-theme-helpers.el]]
  - [[#my-vc-helpersel][my-vc-helpers.el]]
- [[#appendices][Appendices]]
:END:

* Notes on configuring Emacs
:PROPERTIES:
:CUSTOM_ID: notes-on-configuring-emacs
:END:
** Things I found or continue to find particularly confusing
:PROPERTIES:
:CUSTOM_ID: things-i-found-or-continue-to-find-particularly-confusing
:END:
*** Package management and loading packages
:PROPERTIES:
:CUSTOM_ID: package-management-and-loading-packages
:END:
related: 
*** The "right" way to configure package options
:PROPERTIES:
:CUSTOM_ID: the-right-way-to-configure-package-options
:END:
** Notes while figuring out how to make header and footer templates
:PROPERTIES:
:CUSTOM_ID: notes-while-figuring-out-how-to-make-header-and-footer-templates
:END:
*** Potentially useful
**** noweb syntax
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 01:06]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
=< <code-block-name> >= (no spaces between brackets, just a rendering workaround) Insert the literal body of code block code-block-name itself.

=< <code-block-name()> >=: Insert the *results of evaluating the code block code-block-name (as obtained with org-babel-execute-src-block). That can be of different types: LaTeX, etc.

=< <code-block-name(x = 3.3)> >=: Insert the results of evaluating it with the specified argument value.

Note that you can customize org-babel-noweb-wrap-start and org-babel-noweb-wrap-end to use something else than angle brackets (for example, double quotes).

/Problem:/ doesn't seem to be suitable for passing an argument in a variable that's defined in the header or in a property due to the order things are evaluated but I'm not super confident about that. 
