its-lit.org
*** Base and built-in file header
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 18:05]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/configure-base-and-built-in.el :comments no :noweb no
;;; configure-base-and-built-in.el --- Built-in packages -*- lexical-binding: t -*-
;;; Commentary:
;;; Code:
#+end_src
*** Configure base emacs options
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 20:47]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp
(use-package emacs
  :ensure nil
  :init
  (setq trash-directory "~/.Trash")
  :config
  (setopt enable-recursive-minibuffers t
          user-full-name "John Sperger"
          user-mail-address "josp@duck.com"
          initial-scratch-message nil   ; "make scratch buffer empty"
          tab-width 2 ; tab-width default 2 instead of 4
          fill-column 80 ; fill-column default 80 chars
          ring-bell-function 'ignore ;no beep
          undo-limit 67108864 ; increases undo limit 64mb.
          undo-strong-limit 100663296 ; 96mb.
          undo-outer-limit 1006632960 ; 960mb.
          sentence-end-double-space nil ;single space between sentences
          use-short-answers t ; use y/n instead of yes/no
          compilation-scroll-output 'first-error ;scroll to 1st error/end compile
          delete-by-moving-to-trash t ; use system trash for file deletion
          )
  ;; Highlight and allow to open http link at point in programming buffers
  ;; goto-address-prog-mode only highlights links in strings and comments
  (add-hook 'prog-mode-hook #'goto-address-prog-mode)
  ;; Highlight and follow bug references in comments and strings
  (add-hook 'prog-mode-hook #'bug-reference-prog-mode)
  ;; enable subword-mode in prog-mode
  (add-hook 'prog-mode-hook #'subword-mode)
  
  )

#+end_src
*** Configuring built-in packages
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 18:05]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp 
(use-package autorevert
  :ensure nil
  :hook (elpaca-after-init . global-auto-revert-mode)
  :config
  (setopt global-auto-revert-non-file-buffers t
          auto-revert-verbose nil
  )
)

(use-package dired
  :ensure nil
  :defer t
  :config
  (setopt dired-auto-revert-buffer t
          dired-kill-when-opening-new-dired-buffer  t
          dired-create-destination-dirs 'always
          dired-do-revert-buffer t
          dired-dwim-target t
          dired-vc-rename-file t
          )
  )
#+end_src

*** Configure built-in programming utilities
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 18:54]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
- =glasses= separates CamelCase words visually into '=Camel_Case='
#+begin_src emacs-lisp
(use-package display-line-numbers
  :ensure nil
  :hook ((text-mode prog-mode conf-mode) . display-line-numbers-mode)
  :config
  (setopt display-line-numbers-type t
          display-line-numbers-width-start 100)
  )

;; (use-package elec-pair
;;   :ensure nil
;; 	:defer t
;; 	:custom (electric-pair-mode 1))


(use-package flymake
  :ensure nil
  :hook (prog-mode . flymake-mode)
;; no idea what this is from, I don't see the function in help so may be outdated
;; :init (remove-hook 'flymake-diagnostic-functions 'flymake-proc-legacy-flymake)
  )

(use-package glasses
	:ensure nil
	:hook (ess-r-mode . glasses-mode)
	:config
	(setopt glasses-separate-parentheses-p nil)
)

(use-package whitespace
  :ensure nil
  :hook (diff-mode . whitespace-mode)
  )
#+end_src

*** Configure ediff for viewing diffs
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 18:54]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

I really need to learn how to use =ediff= properly
#+begin_src emacs-lisp
(use-package ediff
  :ensure nil
  :defer t
  :config
  (setopt ediff-window-setup-function 'ediff-setup-windows-plain
          ediff-split-window-function 'split-window-horizontally
          ediff-merge-split-window-function 'split-window-horizontally
          )
  )

#+end_src

*** Built-in package configuration that were in a separate file for some reason
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 18:54]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp
(use-package doc-view
  :ensure nil
  :defer t
  :config (setopt doc-view-resolution 330)
  )

(use-package files
  :ensure nil
  :defer t
  :config
  (add-to-list 'find-file-not-found-functions 'make-directory-maybe nil #'eq)
  )

(use-package newcomment
  :ensure nil
  :defer t
  :commands comment-or-uncomment
  :config
  (defun comment-or-uncomment (n)
    (interactive "*p")
    (if (or (region-active-p)
            (save-excursion
              (beginning-of-line)
              (looking-at "\\s-*$")))
        (call-interactively 'comment-dwim)
      (comment-or-uncomment-region
       (line-beginning-position) (line-end-position n)))))

(use-package project
  :ensure nil
  :defer t
  :config
  (setopt project-vc-merge-submodules nil
          project-switch-commands '((project-switch-to-buffer "Find buffer")
                                    (project-find-file "Find file")
                                    (project-find-regexp "Find regexp")
                                    (project-find-dir "Find directory"))
          project-switch-use-entire-map t
          )
  (add-to-list 'project-find-functions 'project-try-root t)
  )

(use-package recentf
  :ensure nil
  :defer t
  :custom (recentf-mode 1)
  :config (setopt recentf-auto-cleanup 'never
                  recentf-max-saved-items 250)
  )

(use-package savehist
  :ensure nil
  :defer t
  :custom (savehist-mode 1)
  :config
  (setopt enable-recursive-minibuffers t ; allow commands in minibuffers
          history-length 500
          savehist-autosave-interval nil
          savehist-additional-variables '(evil-jumps-history
                                          mark-ring global-mark-ring
                                          search-ring regexp-search-ring
                                          extended-command-history)
          )
  (add-hook 'savehist-save-hook #'savehist-unpropertize-variables-h)
  (add-hook 'savehist-save-hook #'savehist-remove-unprintable-registers-h)
  )


(use-package saveplace
  :ensure nil
  :custom (save-place-mode 1))

(use-package simple
  ;; basic editing commands for emacs
  :ensure nil
  :defer t
  :config
  (setopt column-number-mode t
          delete-trailing-lines nil
          eval-expression-print-length nil
          eval-expression-print-level nil
          next-error-message-highlight t
          ;; save clipboard contents into kill-ring before replace them
          save-interprogram-paste-before-kill t
          )
  )

(use-package winner
  :ensure nil
  :defer t
  :commands (winner-undo winner-redo)
  :init
  (setq winner-dont-bind-my-keys t)
  :custom
  (winner-mode 1)
  :config
  (setopt winner-boring-buffers-regexp "\\*.*\\*")
  )
#+end_src

*** =which-key= configuration
:PROPERTIES:
:CUSTOM_ID: which-key-config
:LAST_MODIFIED: [2025-07-18 Fri 18:00]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
=which-key= is built in now (starting with Emacs 30?)

#+begin_src emacs-lisp
(use-package which-key
  :ensure nil
  :hook (elpaca-after-init)
  :config
  (setopt which-key-idle-delay 0.4
        which-key-idle-secondary-delay 0.01
        which-key-max-description-length 32
        which-key-sort-order 'which-key-key-order-alpha
        which-key-allow-evil-operators t)
  (push '((nil . "tab-bar-select-tab") . t) which-key-replacement-alist))
#+end_src

*** Base and built-in configuration footer
:PROPERTIES:
:CUSTOM_ID: base-built-in-footer
:LAST_MODIFIED: [2025-07-18 Fri 19:04]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp :comments no :noweb no
;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; configure-base-and-built-in ends here
#+end_src
*** Removed declarations
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 17:34]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:header-args: :tangle no :comments no
:END:
Off the top of my head, I think
- =dabbrev= conflicts with =acm= the completion package for =lsp-bridge=
- =repeat= doesn't have any customization and just isn't necessary as it's builtin?
- =sqlite= was trying to make sure I was using the builtin version

#+name: removed built-in package declarations
#+begin_src emacs-lisp :tangle no :comments no :eval no
;; (use-package dabbrev
;;  :ensure nil
;;  :defer t
;;  :config
;;  (setopt dabbrev-abbrev-char-regexp "[A-Za-z-_]"
;;       dabbrev-ignored-buffer-regexps '("\\.\\(?:pdf\\|jpe?g\\|png\\)\'")))

;;(use-package repeat
;;  :ensure nil
;;  :defer t
;;  )

;;(use-package sqlite
;;  :ensure nil)
#+end_src


