its-lit.org
** setup-core.el
:PROPERTIES:
:CUSTOM_ID: setup-coreel
:LAST_MODIFIED: [2025-07-18 Fri 04:25]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-core.el
;;; config/setup-core.el --- Core configuration -*- lexical-binding: t -*-

(use-package ultra-scroll
  :ensure (ultra-scroll :type git :host github :repo "jdtsmith/ultra-scroll")
  :init  (setq scroll-conservatively 50
               scroll-margin 0) 
  :config (ultra-scroll-mode 1)
  )

;; autosave each change
(setopt bookmark-save-flag 1)

;; keep focus while navigating help buffers
(setopt help-window-select t)

;; When emacs asks for "yes" or "no", let "y" or "n" suffice
;; (fset 'yes-or-no-p 'y-or-n-p)
(setopt use-short-answers t)

;; don't load outdated compiled files.
(setopt load-prefer-newer t)

;; don't save duplicates in kill-ring
(setopt kill-do-not-save-duplicates t)

;; break lines after more characters
(setopt word-wrap-by-category t)

(add-hook 'server-visit-hook #'server-remove-kill-buffer-hook)

;; Do not allow the cursor in the minibuffer prompt
(setopt minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
(add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-core.el ends here
#+end_src

*** Removed core customizations
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 18:43]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle no :eval no
(use-package desktop
  :disabled
  :ensure nil
  :commands restart-emacs-without-desktop
  :init (desktop-save-mode)
  :config
  ;; inhibit no-loaded prompt
  (setopt desktop-file-modtime (file-attribute-modification-time
                                (file-attributes
                                 (desktop-full-file-name)))
          desktop-lazy-verbose nil
          desktop-load-locked-desktop t
          desktop-restore-eager nil
          desktop-save t)

  (dolist (param '(foreground-color background-color background-mode font cursor-color mouse-color))
    (push `(,param . :never) frameset-filter-alist))

  (advice-add 'desktop-read :around #'desktop-read@inhibit-message))


#+end_src
** Configure all things org mode
:PROPERTIES:
:header-args: :tangle config/configure-org.el :comments noweb
:LAST_MODIFIED: [2025-07-18 Fri 23:14]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: configure-all-things-org-mode
:END:

*** Configure org header
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 23:16]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :comments no :noweb no
;;; configure-org.el --- Org-mode and its children -*- lexical-binding: t -*-
;;; Commentary:
;;; Code:
#+end_src

*** Configure base org settings and major mode keybinds
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 23:19]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp
(use-package org
  :commands (org-toggle-hidden-emphasis-markers)
  :init
  (setq org-directory "~/obsidian/org/"
        org-inbox-file (concat org-directory "inbox.org")
        org-default-notes-file org-inbox-file
        org-project-file (concat org-directory "projects.org")
        org-confirm-babel-evaluate nil
        )
  :config
  (setopt org-latex-bib-compiler "biber"
          org-latex-compiler "lualatex"
          org-babel-load-languages '((emacs-lisp . t)
                                     (R . t)
                                     (shell . t)
                                     )
          )

  (use-package oc
    :ensure nil
    :config
    (setq org-cite-export-processors '((latex biblatex)
                                       (t csl))
          org-cite-global-bibliography '("~/obsidian/obsidian-biblatex.bib")))

  (use-package org-indent
    :ensure nil)
  (use-package org-protocol
    :ensure nil
    )
  :general
  (despot-def org-mode-map
    "'"     'org-edit-special
    ","     'org-ctrl-c-ctrl-c
    "*"     'org-ctrl-c-star
    "-"     'org-ctrl-c-minus
    "#"     'org-update-statistics-cookies
    "RET"   'org-ctrl-c-ret
    "M-RET" 'org-meta-return
    "b"     (cons "babel" (make-sparse-keymap))
    "ba"    'org-babel-sha1-hash
    "bb"    'org-babel-execute-buffer
    "bc"    'org-babel-check-src-block
    "bd"    'org-babel-demarcate-block
    "be"    'org-babel-execute-maybe
    "bf"    'org-babel-tangle-file
    "bg"    'org-babel-goto-named-src-block
    "bh"    'org-babel-describe-bindings
    "bi"    'org-babel-lob-ingest
    "bI"    'org-babel-view-src-block-info
    "bj"    'org-babel-insert-header-arg
    "bl"    'org-babel-load-in-session
    "bn"    'org-babel-next-src-block
    "bo"    'org-babel-open-src-block-result
    "bp"    'org-babel-previous-src-block
    "br"    'org-babel-goto-named-result
    "bs"    'org-babel-execute-subtree
    "bt"    'org-babel-tangle
    "bu"    'org-babel-goto-src-block-head
    "bv"    'org-babel-expand-src-block
    "bx"    'org-babel-do-key-sequence-in-edit-buffer
    "bz"    'org-babel-switch-to-session
    "e"     (cons "export" (make-sparse-keymap))
    "ee"    'org-export-dispatch
    "eb"    'org-beamer-export-to-pdf
    "el"    'org-latex-export-to-latex
    "ep"    'org-latex-export-to-pdf
    "i"     (cons "insert" (make-sparse-keymap))
    "ib"    'org-insert-structure-template
    "ic"    'org-cite-insert
    "id"    'org-insert-drawer
    "if"    'org-footnote-new
    "ih"    'org-insert-heading
    "iH"    'org-insert-heading-after-current
    "ii"    'org-id-get-create
    "iI"    'org-insert-item
    "il"    'org-insert-link
    "in"    'org-add-note
    "ip"    'org-set-property
    "is"    'org-insert-subheading
    "it"    'org-set-tags-command
    "t"     (cons "tables" (make-sparse-keymap))
    "ta"    'org-table-align
    "tb"    'org-table-blank-field
    "tc"    'org-table-convert
    "td"    (cons "delete" (make-sparse-keymap))
    "tdc"   'org-table-delete-column
    "tdr"   'org-table-kill-row
    "te"    'org-table-eval-formula
    "tE"    'org-table-export
    "tf"    'org-table-field-info
    "th"    'org-table-previous-field
    "tH"    'org-table-move-column-left
    "ti"    (cons "insert" (make-sparse-keymap))
    "tic"   'org-table-insert-column
    "tih"   'org-table-insert-hline
    "tiH"   'org-table-hline-and-move
    "tir"   'org-table-insert-row
    "tI"    'org-table-import
    "tj"    'org-table-next-row
    "tJ"    'org-table-move-row-down
    "tK"    'org-table-move-row-up
    "tl"    'org-table-next-field
    "tL"    'org-table-move-column-right
    "tn"    'org-table-create
    "tN"    'org-table-create-with-table.el
    "tp"    'org-plot/gnuplot
    "tr"    'org-table-recalculate
    "ts"    'org-table-sort-lines
    "tt"    (cons "toggles" (make-sparse-keymap))
    "ttf"   'org-table-toggle-formula-debugger
    "tto"   'org-table-toggle-coordinate-overlays
    "tw"    'org-table-wrap-region
    "T"     (cons "toggles" (make-sparse-keymap))
    "Tc"    'org-toggle-checkbox
    "Td"    'org-modern-indent-mode
    "TD"    'org-indent-mode
    "Te"    'org-toggle-pretty-entities
    "Ti"    'org-toggle-inline-images
    "Tl"    'org-toggle-link-display
    "Tm"    'org-toggle-hidden-emphasis-markers
    "Tt"    'org-show-todo-tree
    "Tx"    'org-latex-preview
    "x"     (cons "text" (make-sparse-keymap))
    "xb"    'org-bold
    "xc"    'org-code
    "xi"    'org-italic
    "xo"    'org-open-at-point
    "xr"    'org-clear
    "xs"    'org-strike-through
    "xu"    'org-underline
    "xv"    'org-verbatim)

  (general-def 'normal org-mode-map "RET" 'org-open-at-point)

  (tyrant-def
    "O"      (cons "Org" (make-sparse-keymap))
    "O/"     'org-occur-in-agenda-files
    "Oa"     'org-agenda
    "Oc"     'org-capture
    "OC"     (cons "clock" (make-sparse-keymap))
    "OCc"    'org-clock-cancel
    "OCg"    'org-clock-goto
    "OCi"    'org-clock-in-last
    "OCj"    'org-clock-jump-to-current-clock
    "OCo"    'org-clock-out
    "OCr"    'org-resolve-clocks
    "Od"     'open-org-default-notes-file
    "Ol"     'org-store-link
    "Op"     'open-org-project-file
    "Ot"     'org-transclusion-mode
    )
  )
#+end_src
*********** Configure org functionality add-ons
:PROPERTIES:
:CUSTOM_ID: setup-orgel
:LAST_MODIFIED: [2025-07-18 Fri 23:23]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp 
(use-package org-make-toc
  :after org
  :hook org-mode
  :config (setopt org-make-toc-insert-custom-ids t)
  )

(use-package org-modern
  :hook (org-mode . org-modern-mode)
  :config
  (set-face-attribute 'org-modern-symbol nil :family "Iosevka")
  (setopt  org-auto-align-tags nil
           org-tags-column 0
           org-catch-invisible-edits 'show-and-error
           org-special-ctrl-a/e t
           org-insert-heading-respect-content t
           org-hide-emphasis-markers t
           org-pretty-entities t
           org-ellipsis "")
  )

(use-package org-transclusion
  :after org
  :general
  (despot-def org-mode-map
    "l" 'org-transclusion-add
    "L"     (cons "transclusion" (make-sparse-keymap))
    "L TAB" 'org-cycle
    "Ld" 'org-transclusion-remove
    "LD" 'org-transclusion-detach
    "Lj" 'org-transclusion-demote-subtree
    "Lk" 'org-transclusion-promote-subtree
    "Lm" 'org-transclusion-move-to-source
    "Ls" 'org-transclusion-live-sync-start
    "Lr" 'org-transclusion-refresh
    "Lo" 'org-transclusion-open-source
    )
  )
#+end_src

**** Disabled org functionality packages
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 23:22]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:header-args: :tangle no :comments no
:END:

#+begin_src emacs-lisp
(use-package org-side-tree
  :disabled
  :hook org-mode
  :config
  (setopt org-side-tree-persistent nil
	  org-side-tree-fontify t
	  org-side-tree-enable-folding t)
  )
(use-package org-pdftools
  :disabled
  :hook (org-mode . org-pdftools-setup-link))

(use-package org-noter-pdftools
  :disabled
  :after org-noter
  :config
  (with-eval-after-load 'pdf-annot
    (add-hook 'pdf-annot-activate-handler-functions #'org-noter-pdftools-jump-to-note))
  )

(use-package org-contrib
  :disabled
  :after org
  )
#+end_src

*** Configure org mode's progeny
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 04:45]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
Packages that build on org mode rather than add something to it.
**** org-todoist
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 04:44]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp
(use-package org-todoist
  :after gptel ; why would this depend on gptel? oh my api key olol
  :ensure (:host github
                 :repo "lillenne/org-todoist"
                 :branch "main"
                 )
  :init
  (setq org-todoist-api-token (gptel-api-key-from-auth-source "api.todoist.com" "apikey"))

  :general (tyrant-def "aT" 'org-todoist-dispatch)
  )
#+end_src
**** Configure Org-node :TODO:
:PROPERTIES:
:CUSTOM_ID: setup-org-nodeel
:LAST_MODIFIED: [2025-07-19 Sat 04:44]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

Disabling this until I have time to sit down and give it an honest effort. 
#+begin_src emacs-lisp :tangle no
(use-package org-mem
  :defer
  :functions org-mem-updater
  :config
  (setopt org-mem-do-sync-with-org-id t
          org-mem-watch-dirs (list "~/obsidian/org/node")
          )
  (org-mem-updater-mode)
  )

(use-package org-node
  :after org
  :init
  (keymap-global-set "M-o n" org-node-global-prefix-map)
  (with-eval-after-load 'org
    (keymap-set org-mode-map "M-o n" org-node-org-prefix-map))
  :config
  (org-node-cache-mode)
  :general
  (tyrant-def
    "n"      (cons "node" (make-sparse-keymap))
    "nf" 'org-node-find
    "ni" 'org-node-insert-link
    "nb" 'org-node-context-dwim
    "nd" 'org-node-insert-into-related
    "ng" 'org-node-grep
    "nn" 'org-node-nodeify-entry
    "ns" 'org-node-seq-dispatch
    "nw" 'org-node-refile
    "nr" 'org-node-visit-random
    "nt" 'org-node-insert-transclusion
    "nu" 'org-node-insert-raw-link
    "ns" 'org-node-insert-transclusion-as-subtree
    )
  )
#+end_src

*** Configuring org capture templates :TODO:
:PROPERTIES:
:CUSTOM_ID: setup-org-captureel
:LAST_MODIFIED: [2025-07-19 Sat 04:45]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle no
(use-package doct)
#+end_src

*** Add additional ways to export from org to other formats
:PROPERTIES:
:CUSTOM_ID: setup-org-exportersel
:LAST_MODIFIED: [2025-07-19 Sat 04:41]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp
(use-package ox-pandoc
	:after org
	:hook (org-mode . org-pandoc-startup-check))

(use-package ob-mermaid
  :after org)
#+end_src

**** Disabled Exporters
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 04:45]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp :tangle no
(use-package ox-tufte
	:disabled
	:after org
  )

(use-package ox-beamer-lecture
	:after org)
#+end_src
*** Configure org footer
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 20:34]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp :comments no :noweb no
;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; configure-org.el ends here
#+end_src

** Configure (programming) language-specific options
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 05:02]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: configure-programming-language-specific-options
:END:
*** setup-python.el
:PROPERTIES:
:CUSTOM_ID: setup-pythonel
:END:
#+begin_src emacs-lisp :tangle config/setup-python.el
;;; config/setup-python.el --- Python configuration -*- lexical-binding: t -*-

(use-package python-x
	)

(use-package live-py-mode
	:general
	  (despot-def (python-mode-map)
    :major-modes '(python-mode python-ts-mode)
    "l" 'live-py-mode
    )
	)

(use-package uv-mode
	:hook (python-mode . uv-mode))

(use-package pyenv-mode
	:disabled)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-python.el ends here
#+end_src

