its-lit.org
*** setup-r.el
:PROPERTIES:
:CUSTOM_ID: setup-rel
:LAST_MODIFIED: [2025-07-18 Fri 21:46]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-r.el
;;; config/setup-r.el --- R language configuration -*- lexical-binding: t -*-

(use-package ess
  :mode ("\([rR]\)\'" . R-mode)
  :init
  (setq ess-set-style t
        comint-scroll-to-bottom-on-input t
        comint-scroll-to-bottom-on-output t
        ess-indent-offset 2)
  (add-hook 'inferior-ess-mode-hook
            (lambda ()
              (add-to-list 'mode-line-process '(:eval (nth ess--busy-count ess-busy-strings)))))
  :custom
  (inferior-R-args "--no-save")
  (ess-indent-offset 2)
  (ess-own-style-list '(
                        (ess-indent-offset . 2)
                        (ess-offset-arguments . prev-call)
                        (ess-offset-arguments-newline . prev-line)
                        (ess-offset-block . prev-line)
                        (ess-offset-continued . straight)
                        (ess-align-nested-calls "ifelse")
                        (ess-align-arguments-in-calls "function[ 	]*(")
                        (ess-align-continuations-in-calls . t)
                        (ess-align-blocks control-flow)
                        (ess-indent-from-lhs arguments fun-decl-opening)
                        (ess-indent-from-chain-start . t)
                        (ess-indent-with-fancy-comments . nil))
                      )
  (ess-style 'OWN)
  :config (setopt  ess-ido-flex-matching nil
                   ess-use-R-completion nil
                   ess-use-company nil
                   ess-use-flymake nil
                   ess-use-ido nil
                   )
  :general
  (despot-def (ess-r-mode-map)
    :major-modes '(ess-r-mode R-mode)
    "b" 'ess-eval-buffer
    "c" 'ess-eval-region-or-function-or-paragraph
    "TAB" 'ess-install-library
    "f" 'ess-eval-function
    "F" 'air-format
    "r" 'run-ess-r
    "v" 'oc-set-ess-offset
    )
  )

(use-package r-ts-mode
  :disabled
  :hook (R-mode . r-ts-mode)
  :ensure (r-ts-mode
	   :type git :host github :repo "nverno/r-ts-mode"))

(use-package essgd
	:general
	  (despot-def (ess-r-mode-map)
			:major-modes 'ess-r-mode
			"g" 'essgd-start)
	)

(use-package ess-view-data
	:disabled)

(use-package poly-R
  :mode ("\\.qmd\\'" . poly-markdown+R-mode)
  )

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-r.el ends here
#+end_src

*** setup-rust.el
:PROPERTIES:
:CUSTOM_ID: setup-rustel
:END:
#+begin_src emacs-lisp :tangle config/setup-rust.el
;;; config/setup-rust.el --- Rust language configuration -*- lexical-binding: t -*-

(use-package rust-mode
	:mode ("\\.rs\\\'" . rust-mode)
  :general
  (despot-def (rust-mode-map)
      :major-modes '(rust-ts-mode rust-mode)
      "c"            'rust-compile
			"k" 'rust-check
			"t" 'rust-test
			"r" 'rust-run
			"F" 'rust-format-buffer)
	)

(use-package cargo-mode
  :hook
  (rust-mode . cargo-minor-mode)
  :config
  (setopt compilation-scroll-output t
			rust-format-on-save t)
	:general
	(despot-def (rust-mode-map)
		:major-modes '(rust-mode rust-ts-mode)
		"e" 'cargo-mode-execute-task
		"t" 'cargo-mode-test
		"l" 'cargo-mode-last-command
		"b" 'cargo-mode-build
		"o" 'cargo-mode-test-current-buffer
		"f" 'cargo-mode-test-current-test)
	)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-rust.el ends here

#+end_src

