its-lit.org
*** setup-tex.el
:PROPERTIES:
:CUSTOM_ID: setup-texel
:END:
#+begin_src emacs-lisp :tangle config/setup-tex.el
;;; config/setup-tex.el --- TeX and LaTeX configuration -*- lexical-binding: t -*-

(use-package auctex
  :mode ("\\.tex\\'" . LaTeX-mode)
  :hook (LaTeX-mode . hs-minor-mode)
  (LaTeX-mode . outline-minor-mode)
  (LaTeX-mode . auto-fill-mode)
  (LaTeX-mode . TeX-fold-mode)
    (LaTeX-mode . LaTeX-math-mode)
  :general
  (despot-def (TeX-latex-mode-map)
    :major-modes '(TeX-tex-mode LaTeX-mode)
    ","             'TeX-command-master
    "a"             'TeX-command-run-all
    "b"             'TeX-command-menu
    "c"             'TeX-clean
    "h"             'TeX-doc
    "k"             'TeX-kill-job
    "l"             'TeX-recenter-output-buffer
    "n"             'TeX-next-error
    "N"             'TeX-previous-error
    "v"             'TeX-view
    "x"             (cons "text/fonts" (make-sparse-keymap))
    "xb"            'font-bold
    "xc"            'font-code
    "xe"            'font-emphasis
    "xi"            'font-italic
    "xr"            'font-clear
    "xo"            'font-oblique
    "xf"            (cons "fonts" (make-sparse-keymap))
    "xfc"           'font-small-caps
    "xff"           'font-sans-serif
    "xfr"           'font-serif
    "z"             (cons "fold" (make-sparse-keymap))
    "z="            'TeX-fold-math
    "zb"            'TeX-fold-buffer
    "zB"            'TeX-fold-clearout-buffer
    "ze"            'TeX-fold-env
    "zI"            'TeX-fold-clearout-item
    "zm"            'TeX-fold-macro
    "zp"            'TeX-fold-paragraph
    "zP"            'TeX-fold-clearout-paragraph
    "zr"            'TeX-fold-region
    "zR"            'TeX-fold-clearout-region
    "zz"            'TeX-fold-dwim)

  (despot-def LaTeX-mode-map
    :major-modes '(LaTeX-mode)
    "."                'LaTeX-mark-environment
    ","             'TeX-command-master
    "a"             'TeX-command-run-all
    "c"             'TeX-clean
    "e"                'LaTeX-environment
    "f"                (cons "fill" (make-sparse-keymap))
    "fe"               'LaTeX-fill-environment
    "fp"               'LaTeX-fill-paragraph
    "fr"               'LaTeX-fill-region
    "fs"               'LaTeX-fill-section
    "h"             'TeX-doc
    "k"             'TeX-kill-job
    "l"             'TeX-recenter-output-buffer
    "n"             'TeX-next-error
    "N"             'TeX-previous-error
    "p"                (cons "preview" (make-sparse-keymap))
    "pb"               'preview-buffer
    "pc"               'preview-clearout
    "pd"               'preview-document
    "pe"               'preview-environment
    "pf"               'preview-cache-preamble
    "pp"               'preview-at-point
    "pr"               'preview-region
    "ps"               'preview-section
    "r"                (cons "reference" (make-sparse-keymap))
    "rr"               'reftex-reference
    "rl"               'reftex-label
    "rj"               'reftex-goto-label
    "s"                'LaTeX-section
    "x"                (cons "text/fonts" (make-sparse-keymap))
    "xB"               'font-medium
    "xu"               'font-underline
    "xf"               (cons "fonts" (make-sparse-keymap))
    "xfa"              'font-calligraphic
    "xfn"              'font-normal
    "xfu"              'font-upright
    "xi"               'font-italic
    "xr"               'font-clear
    "xo"               'font-oblique
    "v"             'TeX-view
    "x"             (cons "text/fonts" (make-sparse-keymap))
    "xb"            'font-bold
    "xc"            'font-code
    "xe"            'font-emphasis
    "xi"            'font-italic
    "xr"            'font-clear
    "xo"            'font-oblique
    "xf"            (cons "fonts" (make-sparse-keymap))
    "xfc"           'font-small-caps
    "xff"           'font-sans-serif
    "xfr"           'font-serif
    "z"             (cons "fold" (make-sparse-keymap))
    "z="            'TeX-fold-math
    "zb"            'TeX-fold-buffer
    "zB"            'TeX-fold-clearout-buffer
    "ze"            'TeX-fold-env
    "zI"            'TeX-fold-clearout-item
    "zm"            'TeX-fold-macro
    "zp"            'TeX-fold-paragraph
    "zP"            'TeX-fold-clearout-paragraph
    "zr"            'TeX-fold-region
    "zR"            'TeX-fold-clearout-region
    "zz"            'TeX-fold-dwim)

  :config
  (setopt TeX-engine 'luatex)
	(add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)
  )

(use-package preview-dvisvgm
  :after auctex)

(use-package xenops
	:disabled)

(use-package cdlatex
	:disabled)

(use-package latex-extra
  :disabled
  :after auctex
  :hook (LaTeX-mode . latex-extra-mode))

(use-package latex-table-wizard
	:disabled)

(use-package evil-tex
	:disabled)

(use-package latex-extra
	:disabled)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-tex.el ends here
#+end_src

** Configure Theming
:PROPERTIES:
:header-args:emacs-lisp: :tangle config/configure-theming.el :comments noweb
:LAST_MODIFIED: [2025-07-19 Sat 19:04]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: configure-theming
:END:

Packages that substantially change the user interface as configured in 

#+name:theme header
#+begin_src emacs-lisp :comments no :noweb no
;;; configure-theming.el --- Themes configuration -*- lexical-binding: t; -*-
;;; Commentary:
;;; Code:
#+end_src

*** Define additional font lock faces

#+begin_src emacs-lisp

#+end_src
*** Color theme packages
:PROPERTIES:
:CUSTOM_ID: color-theme-packages
:LAST_MODIFIED: [2025-07-19 Sat 21:34]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp
(use-package doom-themes)

(use-package ef-themes
  :config (setopt ef-themes-mixed-fonts t)
  )

(use-package flexoki-themes
  :custom
  (flexoki-themes-use-bold-keywords t)
  (flexoki-themes-use-bold-builtins t)
  (flexoki-themes-use-italic-comments nil)
  )

;; Development version I think? Also built in
(use-package modus-themes)
#+end_src

**** Disabled themes
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 21:40]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:header_args:emacs-lisp: :tange no :noweb no :comments no
:END:

***** Just not using at the moment
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 21:44]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
Doric themes are nearly monochrome

#+name: nice just not using currently
#+begin_src emacs-lisp :tangle no
(use-package doric-themes)

(use-package nordic-night-theme)

;; requires special setup?
(use-package evenok	:disabled )
#+end_src

***** Disabled for a reason
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 21:44]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
- Catpppuccin was weirdly slow to load
- Kaolin is okay but I found the color choices to not be the most readable

#+begin_src emacs-lisp :tangle no
(use-package catppuccin-theme
  :disabled)

(use-package kaolin-themes)
#+end_src

#+name: Disabled due to doom redundancy
#+begin_src emacs-lisp :tangle no
(use-package gruvbox-theme)

(use-package solarized-theme
  :disabled)
#+end_src
