its-lit.org
*** Managing fonts
:PROPERTIES:
:CUSTOM_ID: setup-fontsel
:LAST_MODIFIED: [2025-07-19 Sat 19:49]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp
;;;; Font configuration
(use-package fontaine
  :hook (elpaca-after-init . fontaine-mode)
  :config
  (setopt fontaine-presets '(
                             (t  :default-weight normal
                                 :default-height 150
                                 :fixed-pitch-family "JetBrains Mono NL"
                                 :variable-pitch-family "Heliotrope OT"
                                 :variable-pitch-height 1.05
                                 :bold-family nil ; use the face's bold
                                 :bold-weight bold)

;;;;; Presets that keep the same font family but modify its appearance
	                           ;; Presets to change point size only
	                           (10pt :default-height 100)
	                           (11pt :default-height 110)
	                           (12pt :default-height 120)
	                           (13pt :default-height 130)
	                           (14pt :default-height 140)
	                           (15pt :default-height 150)
	                           (16pt :default-height 160)
	                           (17pt :default-height 170)
	                           (18pt :default-height 180)

;; Line spacing is additional line spacing, not total line spacing
;; (i.e. 0 is the default)
;; Meaning differs depending on whether it is an integer or float
;; Integer = additional pixels to add
;; Floating point = additional spacing proportional to point size
	                           (lsd :line-space 0)
	                           ;; line spacing pixels
	                           (lsp1 :line-spacing 1)
	                           (lsp2 :line-spacing 2)
	                           (lsp3 :line-spacing 3)
	                           (lsp4 :line-spacing 4)
	                           (lsp5 :line-spacing 5)
	                           ;; line spacing scaling
	                           (lss05 :line-spacing 0.05)
	                           (lss10 :line-spacing 0.10)
	                           (lss15 :line-spacing 0.15)
	                           (lss20 :line-spacing 0.20)
	                           (lss25 :line-spacing 0.25)
	                           (lss30 :line-spacing 0.30)

;;;;; Font presets

;;;;;; Monospace fonts
	                           (iosevka-comfy
	                            :default-family "Iosevka Comfy"
	                            :default-weight normal)

	                           (fira-mono
	                            :default-family "Fira Mono")

	                           (fira-code
	                            :default-family "FiraCode Nerd Font"
	                            )

	                           (jetbrains-mono
	                            :default-family "JetBrains Mono NL")

	                           (plex-mono
	                            :default-family "IBM Plex Mono")

	                           (dank-mono
	                            :default-family "Dank Mono")

	                           (hack
	                            :default-family "Hack Nerd Font")

	                           ;; think inter is proportional not mono
	                           (inter
	                            :default-family "Inter")

	                           (xenon
	                            :default-family "Monaspace Xenon")

	                           (input-mono
	                            :default-family "Input Mono")
;;;;;; Quasi-monospace fonts
	                           (duospace
	                            :default-family "iA Writer Duospace")

	                           (triplicate-mono-b
	                            :default-family "Triplicate B")

	                           (triplicate-code-b
	                            :default-family "Triplicate B Code")

	                           (triplicate-poly-b
	                            :default-family "Triplicate B Poly")

	                           (triplicate-mono-a
	                            :default-family "Triplicate A")

	                           (triplicate-code-a
	                            :default-family "Triplicate A Code")

	                           (triplicate-poly-a
	                            :default-family "Triplicate A Poly")

	                           (header-triplicate
	                            :header-line-family "Triplicate A Caps"
	                            :header-line-height 1.1)

	                           (triplicate-combo
	                            :default-family "Triplicate A Code"
	                            :variable-pitch-family "Triplicate A Poly"
	                            :header-line-family "Triplicate A Caps"
	                            :header-line-height 1.1
	                            )

                             ;; Not fully variable width but it's not suitable for coding imo.
                             ;; Could be fine for writing in a markup language
                             (quattro
	                            :default-family "iA Writer Quattro V")


;;;;;; Header fonts      
	                           (header-heliotrope
	                            :header-line-family "Heliotrope 4 Caps"
	                            :header-line-height 1.1)

	                           (header-overpass
	                            :header-line-family "Overpass"
	                            :header-line-height 1.1)

                             ;; Don't use a different family for headers 
	                           (header-null
	                            :header-line-family nil
	                            :header-line-height 1.0)

;;;;;; Variable pitch fonts
	                           (serif-input
	                            :variable-pitch-family "Input Serif")

	                           (sans-input
	                            :variable-pitch-family "Input Sans")

	                           (vp-heliotrope
	                            :variable-pitch-family "Heliotrope OT"
	                            :variable-pitch-height 1.05)

	                           (vp-avenir
	                            :variable-pitch-family "Avenir"
	                            :default-weight book)

	                           (vp-minion
	                            :variable-pitch-family "Minion 3")
	                           )
	        )
  :custom (fontaine-mode t)
  )
#+end_src

**** View fonts within emacs
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 19:38]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

Font waterfall and size viewer from within emacs.
#+begin_src emacs-lisp
(use-package show-font
  :general  (tyrant-def  "hs" 'show-font-select-preview
                         "hT" 'show-font-tabulated
                         )
  :bind
  (("C-c s f" . show-font-select-preview)
   ("C-c s t" . show-font-tabulated))
  )

#+end_src
**** Disabled packages
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 19:38]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp :tangle no
(use-package ligature
  :disabled)
#+end_src
*** Theming advice and hooks
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 19:06]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp
(advice-add 'load-theme :after #'load-theme@run-hooks)
(advice-add 'load-theme :before #'load-theme@theme-dont-propagate)

(add-hook 'after-load-theme-hook #'bolder-faces)
(add-hook 'after-load-theme-hook #'customize-tab-bar)
(add-hook 'after-load-theme-hook #'unscale-outlines)
(add-hook 'after-load-theme-hook #'my-disable-flymake-underline)
#+end_src

*** Theming lisp footer
:PROPERTIES:
:LAST_MODIFIED: [2025-07-19 Sat 20:36]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp
;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; configure-theming.el ends here
#+end_src

** setup-comment-tools.el
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 22:10]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: setup-comment-toolsel
:END:

I'm a big fan of the look of banner comments but trying to set a custom prefix it wasn't clear how to keep the language-adaptive comment symbol and add a string afterwards. I always want a space
#+name: comment tools
#+begin_src emacs-lisp :tangle config/setup-comment-tools.el
;;; setup-comment-tools.el ---  -*- lexical-binding: t; -*-
;;; Commentary:
;;; Code:

(use-package banner-comment
  :config  (setopt banner-comment-width 72)
  :general  (tyrant-def "ab" 'banner-comment)
  )


;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-comment-tools.el ends here
#+end_src


** Configure completion frameworks
:PROPERTIES:
:CUSTOM_ID: configure-completion-frameworks
:LAST_MODIFIED: [2025-07-19 Sat 20:37]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

*** setup-completion-actions.el
:PROPERTIES:
:CUSTOM_ID: setup-completion-actionsel
:END:
#+begin_src emacs-lisp :tangle config/setup-completion-actions.el
;;; config/setup-completion-actions.el --- Completion actions -*- lexical-binding: t -*-

(use-package avy
	:general
	(tyrant-def
		"Ja" 'avy-goto-char
		"Jg" 'avy-goto-char-timer
		"Jl" 'avy-goto-line
		"Jw" 'evil-avy-goto-word-1))

(use-package embark
  ;; :init
  ;; (with-eval-after-load 'avy
  ;;   (defun avy-action-embark (pt)
  ;;     (unwind-protect
  ;;         (save-excursion
  ;;           (goto-char pt)
  ;;           (embark-act))
  ;;       (select-window
  ;;        (cdr (ring-ref avy-ring 0))))
  ;;     t)
  ;;   (setf (alist-get ?. avy-dispatch-alist) 'avy-action-embark))
  ;; :config
  ;; (with-eval-after-load 'vertico
  ;;   (defun embark-vertico-indicator ()
  ;;     (let ((fr face-remapping-alist))
  ;;       (lambda (&optional keymap _targets prefix)
  ;;         (when (bound-and-true-p vertico--input)
  ;;           (setq-local face-remapping-alist
  ;;                       (if keymap
  ;;                           (cons '(vertico-current . embark-target) fr)
  ;;                         fr))))))

  ;;   (add-to-list 'embark-indicators #'embark-vertico-indicator))
  :config
  (defun bibtex-key-embark ()
  (save-excursion
    (bibtex-beginning-of-entry)
    (when (looking-at bibtex-entry-maybe-empty-head)
      (cons 'bibtex-key
            (bibtex-key-in-head)))))


  :general
  (:keymaps '(global normal)
            "C-." 'embark-act
            "M-." 'embark-dwim))

(use-package embark-consult
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))

(use-package avy-embark-collect
	:disabled)

(use-package consult-dir
	:general
    (vertico-map "C-d"   'consult-dir
                 "C-j"   'consult-dir-jump-file))

(use-package consult-gh-forge
	:disabled
	:after consult-gh
	:custom
	(consult-gh-forge-mode +1))

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-completion-actions.el ends here
#+end_src

*** Set up completion backends
:PROPERTIES:
:CUSTOM_ID: set-up-completion-backends
:END:
:PROPERTIES:
:CUSTOM_ID: setup-completion-backendsel
:LAST_MODIFIED: [2025-07-15 Tue 19:05]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50 (build 1, aarch64-apple-darwin24.5.0, NS appkit-2575.60 Version 15.5 (Build 24F74))
of 2025-07-06
:END:
#+begin_src emacs-lisp :tangle config/setup-completion-backends.el
;;; setup-completion-backends.el --- Completion backends -*- lexical-binding: t -*-

(use-package orderless
  :init
  (setq completion-styles '(orderless basic)
        completion-category-defaults nil)
  :config
(defun flex-if-twiddle (pattern _index _total)
  (when (string-suffix-p "~" pattern)
    `(orderless-flex . ,(substring pattern 0 -1))))

(defun without-if-bang (pattern _index _total)
  (cond
   ((equal "!" pattern)
    '(orderless-literal . ""))
   ((string-prefix-p "!" pattern)
    `(orderless-without-literal . ,(substring pattern 1)))))
  (setopt orderless-style-dispatchers '(flex-if-twiddle without-if-bang))
)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-completion-backends.el ends here
#+end_src
**** Other completion backends
:PROPERTIES:
:LAST_MODIFIED: [2025-07-15 Tue 19:13]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50 (build 1, aarch64-apple-darwin24.5.0, NS appkit-2575.60 Version 15.5 (Build 24F74))
of 2025-07-06
:END:
#+begin_src eamcs-lisp :tangle no
(use-package prescient
        :disabled
        :config  (setopt prescient-sort-full-matches-first t
                         prescient-sort-length-enable nil)
        )

(use-package corfu-prescient
	:disabled
	:after prescient
  :hook (corfu-mode . corfu-prescient-mode)
  :init
  (setq corfu-prescient-enable-filtering t)
	)

(use-package vertico-prescient
	:disabled
	:after prescient
	:hook (vertico-mode . vertico-prescient-mode)
	:init
	(setq vertico-prescient-enable-filtering t)
	)
#+end_src
*** Annotate completion options
:PROPERTIES:
:CUSTOM_ID: annotate-completion-options
:END:
:PROPERTIES:
:CUSTOM_ID: annotate-completion-options
:LAST_MODIFIED: [2025-07-15 Tue 19:14]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50 (build 1, aarch64-apple-darwin24.5.0, NS appkit-2575.60 Version 15.5 (Build 24F74))
of 2025-07-06
:END:

#+begin_src emacs-lisp :tangle config/setup-completion-display.el
;;; config/setup-completion-display.el --- Completion display -*- lexical-binding: t -*-

(use-package marginalia
  :custom
  (marginalia-mode t))

(use-package epkg-marginalia
  :after marginalia
  :config
  (setcar (alist-get 'package marginalia-annotator-registry)
          #'epkg-marginalia-annotate-package)
  )

(use-package nerd-icons-completion
  :after marginalia
  :hook (marginalia-mode . nerd-icons-completion-mode)
  :config (setopt nerd-icons-completion-mode t)
  )
;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-completion-display.el ends here
#+end_src

