its-lit.org
** setup-data-formats.el
:PROPERTIES:
:CUSTOM_ID: setup-data-formatsel
:LAST_MODIFIED: [2025-07-15 Tue 19:28]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-data-formats.el
;;; setup-data-formats.el --- data viewers -*- lexical-binding: t -*-

(use-package csv-mode
  :mode ("\\.csv\\\'" . csv-mode)
  :config
  (add-hook 'csv-mode-hook 'csv-guess-set-separator)
	:general
  (despot-def csv-mode-map
    "s" 'csv-sort-fields
    "n" 'csv-sort-numeric-fields
    "r" 'csv-reverse-region
    "k" 'csv-kill-fields
    "y" 'csv-yank-fields
    "a" 'csv-align-fields
    "A" 'csv-align-mode
    "u" 'csv-unalign-fields
    "t" 'csv-transpose
    )
  )

(use-package emacsql)

(use-package toml)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-data-formats.el ends here
#+end_src
**** Other data viewers
:PROPERTIES:
:LAST_MODIFIED: [2025-07-15 Tue 19:28]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle no
(use-package json-navigator
	:disabled
	)

(use-package jsonian
	:disabled
	:mode ("\\.json\\'")
	:after so-long
  :custom
  (jsonian-no-so-long-mode))

#+end_src
** setup-denote.el
:PROPERTIES:
:CUSTOM_ID: setup-denoteel
:END:
#+begin_src emacs-lisp :tangle config/setup-denote.el
;;; config/setup-denote.el --- Denote configuration -*- lexical-binding: t -*-

(use-package denote
	:hook (dired-mode . denote-dired-mode)
	:general
	(tyrant-def "ad" 'denote
		"l"       (cons "denote" (make-sparse-keymap))
		"ld" 'denote
		"ln" 'denote
		"lb" 'denote-backlinks
		"lr" 'denote-rename-file
		"lR" 'denote-rename-file-using-front-matter
		"ll" 'denote-link
    "lL" 'denote-add-links
		"ld" 'denote-dired
		"lg" 'denote-grep
		)
  :config
  (setq denote-directory (expand-file-name "~/obsidian/org/denote/"))
  (denote-rename-buffer-mode 1)
	)
	
(use-package consult-denote
  :general
	(tyrant-def
		"Jd" 'consult-denote-find
		"JD" 'consult-denote-grep)
  :config
  (consult-denote-mode 1)
	)


(use-package denote-org
	:after denote org
	:general
  (despot-def org-mode-map
    "d"     (cons "denote" (make-sparse-keymap))
    "dh"    'denote-org-link-to-heading
    "dH" 'denote-org-backlinks-for-heading
    "de" 'denote-org-extract-org-subtree

    "dc" 'denote-org-convert-links-to-file-type
    "dd" 'denote-org-convert-links-to-denote-type

    "df" 'denote-org-dblock-insert-files
    "dl" 'denote-org-dblock-insert-links
    "db" 'denote-org-dblock-insert-backlinks
    "dm" 'denote-org-dblock-insert-missing-links
    "dF" 'denote-org-dblock-insert-files-as-headings
		)
	)

(use-package denote-journal
	:after denote
	:commands ( denote-journal-new-entry
							denote-journal-new-or-existing-entry
							denote-journal-link-or-create-entry )
	:hook (calendar-mode . denote-journal-calendar-mode)
	:general
	(tyrant-def
		"aj" 'denote-journal-new-or-existing-entry
		"al" 'denote-journal-link-or-create-entry)
	:config
	(setq denote-journal-directory
				(expand-file-name "journal" denote-directory))
	(setq denote-journal-keyword "journal")
	(setq denote-journal-title-format 'day-date-month-year)
	)

(use-package denote-menu
  :general
  (tyrant-def "lm" 'list-denotes)

  (despot-def (denote-menu-mode-map)
		:major-modes '(denote-menu-mode)
		"c" 'dentoe-menu-clear-filters
    "e" 'denote-menu-export-to-dired
    "k" 'denote-menu-filter-by-keyword
		"r" 'denote-menu-filter
    "o" 'denote-menu-filter-out-keyword
    )
  )

(use-package denote-project-notes
	:after denote
	:general
	(tyrant-def "ps" 'denote-project-notes-show
		"pi" 'denote-project-notes-set-identifier)
	)
(use-package citar-denote
	:hook (denote-after-new-note . citar-denote-mode)
	(denote-fontify-links-mode . citar-denote-mode)
	)

(use-package denote-citar-sections
	:disabled)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-denote.el ends here
#+end_src

** setup-diagramming.el
:PROPERTIES:
:CUSTOM_ID: setup-diagrammingel
:END:
#+begin_src emacs-lisp :tangle config/setup-diagramming.el
;;; config/setup-diagramming.el --- Diagramming tools configuration -*- lexical-binding: t -*-

(use-package chatu
  :hook ((org-mode markdown-mode) . chatu-mode)
  :commands (chatu-add
             chatu-open)
  :custom ((chatu-input-dir "./draws")
           (chatu-output-dir "./draws_out")))

(use-package d2-mode
	:mode ("\\.d2\\'")
	:general
	(despot-def (d2-mode-map)
		:major-modes '(d2-mode)
		"c" 'd2-compile
		"f" 'd2-compile-file
		"b" 'd2-compile-buffer
		"r" 'd2-compile-region
		"h" 'd2-compile-file-and-browse
		"j" 'd2-compile-buffer-and-browse
		"k" 'd2-compile-region-and-browse
		"o" 'd2-open-browser
		"o" 'd2-view-current-svg
		"d" 'd2-open-doc)
	)

(use-package mermaid-mode
			:mode ("\\.mermaid\\''" . mermaid-mode))

(use-package pikchr-mode
		:mode ("\\.pikchr\\''" . pikchr-mode))

(use-package uniline
	:general
(tyrant-def "au" 'uniline-mode)
	)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-diagramming.el ends here
#+end_src

** setup-eaf.el
:PROPERTIES:
:CUSTOM_ID: setup-eafel
:END:
#+begin_src emacs-lisp :tangle config/setup-eaf.el
;;; config/setup-eaf.el --- EAF configuration -*- lexical-binding: t -*-

(use-package eaf
  :ensure nil
  :load-path "~/.emacs.d/site-lisp/emacs-application-framework"
  :custom
  (eaf-browser-continue-where-left-off t)
  (eaf-browser-enable-adblocker t)
  (browse-url-browser-function 'eaf-open-browser)
  :config
  (defalias 'browse-web #'eaf-open-browser)
  ) 

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-eaf.el ends here
#+end_src

** Configure editor utility packages
:PROPERTIES:
:CUSTOM_ID: configure-editor-utility-packages
:LAST_MODIFIED: [2025-07-18 Fri 18:41]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-editor-misc.el
;;; config/setup-editor-misc.el --- Miscellaneous editor configuration -*- lexical-binding: t -*-

(use-package reveal-in-folder
  :general (tyrant-def "bf" 'reveal-in-folder))

;; Conveniently create scratches in the same mode as the current file
(use-package scratch
  :general (tyrant-def "bS" 'scratch))

(use-package terminal-here
  :init (setq terminal-here-mac-terminal-command 'ghostty)
  :general
  (tyrant-def "'" '("terminal here" . terminal-here-launch)
    "p '" '("terminal project root" . terminal-here-project-launch)
    )
  )

(use-package vterm
  :general (tyrant-def "av" 'vterm
             "aV" 'vterm-other-window
             )
  )

(use-package undo-fu
  :config (setopt evil-undo-system 'undo-fu)
  )

(use-package undo-fu-session
  :custom (undo-fu-session-global-mode t)
  )

(use-package winum
  :hook (elpaca-after-init . winum-mode)
  :init
  (with-eval-after-load 'which-key
    (push '((nil . "winum-select-window-[1-9]") . t) which-key-replacement-alist)
    (push '((nil . "buffer-to-window-[1-9]") . t) which-key-replacement-alist))
  :config
  (setq winum-auto-assign-0-to-minibuffer t
        winum-auto-setup-mode-line t
        winum-scope 'frame-local)

  (dotimes (i 9)
    (let ((n (+ i 1)))
      (eval `(defun ,(intern (format "buffer-to-window-%s" n)) (&optional arg)
               ,(format "Move buffer to the window with number %i." n)
               (interactive "P")
               (if arg
                   (move-buffer-to-window ,n t)
                 (swap-buffers-to-window ,n t))))))
  :general
  (tyrant-def
    "1"  '("window 1..9" . winum-select-window-1)
    "2"  'winum-select-window-2
    "3"  'winum-select-window-3
    "4"  'winum-select-window-4
    "5"  'winum-select-window-5
    "6"  'winum-select-window-6
    "7"  'winum-select-window-7
    "8"  'winum-select-window-8
    "9"  'winum-select-window-9
    "b1" '("Move buffer to window 1..9" . buffer-to-window-1)
    "b2" 'buffer-to-window-2
    "b3" 'buffer-to-window-3
    "b4" 'buffer-to-window-4
    "b5" 'buffer-to-window-5
    "b6" 'buffer-to-window-6
    "b7" 'buffer-to-window-7
    "b8" 'buffer-to-window-8
    "b9" 'buffer-to-window-9))

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-editor-misc.el ends here
#+end_src
