its-lit.org
*** Removed packages
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 18:29]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:header-args: :tangle no :comments no
:END:

These packages have the distinction of being useful but I don't use them enough, and if I ever want to use them, I need to add them back in an intentional manner.
=xr=  is for translating and pretty printing regular expressions. I can see its utility but I don't work with regular expressions enough to find it worth keeping.

#+name: useful removed packages
#+begin_src emacs-lisp
(use-package xr)

(use-package password-menu
	;; was using while debugging authinfo api key stuff
	:disabled
	:general
	(tyrant-def "as" 'password-menu-transient)
	)

(use-package substitute
	:general
	(tyrant-def
		"rb" 'substitute-target-in-buffer
		"rd" 'substitute-target-in-defun
		"rj" 'substitute-target-below-point
		"rk" 'substitute-target-above-point)
	:config
	(add-hook 'substitute-post-replace-functions #'substitute-report-operation)
	)

(use-package tmr
	:general
	(tyrant-def "aT" 'tmr-tabulated-view)
	:config
	(setq tmr-sound-file "/usr/share/sounds/freedesktop/stereo/alarm-clock-elapsed.oga")
	(setq tmr-notification-urgency 'normal)
	(setq tmr-descriptions-list 'tmr-description-history)
	(define-key global-map "\C-ct" 'tmr-prefix-map)
	)

(use-package link-hint
  :disabled ; occassionally useful not necessary?
  :config
  (setq link-hint-restore nil)
  :general
  (general-def
    :keymaps '(compilation-mode-map
               custom-mode-map
               eww-link-keymap
               eww-mode-map
               help-mode-map
               helpful-mode-map
               Info-mode-map
               mu4e-view-mode-map
               xref--xref-buffer-mode-map
               woman-mode-map)
    :states  'normal
    "o"      'link-hint-open-link)

  (tyrant-def
    "Jo" 'link-hint-open-link
    "JO" 'link-hint-open-multiple-links
    "Jy" 'link-hint-copy-link)
  )

#+end_src

#+name: removed utilities I don't remember much about
#+begin_src emacs-lisp
(use-package dumb-jump
  :disabled
  :init
  (add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
  (setq dumb-jump-selector 'completing-read)
  )
#+end_src
** setup-emacs.el
:PROPERTIES:
:CUSTOM_ID: setup-emacsel
:END:
#+begin_src emacs-lisp :tangle config/setup-emacs.el
;;; config/setup-emacs.el --- Emacs configuration -*- lexical-binding: t -*-

(use-package emacs
  :ensure nil

  :init
  ;; Add prompt indicator to `completing-read-multiple'.
  ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
  (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

  ;; Do not allow the cursor in the minibuffer prompt
  (setopt minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

  ;; Emacs 28: Hide commands in M-x which do not work in the current mode.
  ;; Vertico commands are hidden in normal buffers.
  (setopt read-extended-command-predicate
        #'command-completion-default-include-p)

  ;; Enable recursive minibuffers
  (setopt enable-recursive-minibuffers t)

	(set-language-environment 'utf-8)
	(set-default-coding-systems 'utf-8)


	:config
	(setopt user-full-name "John Sperger"
					user-mail-address "josp@duck.com"
					initial-scratch-message nil   ; "make scratch buffer empty"
					inhibit-startup-message t   ; "disable splash screen"
					tab-width 2 ; tab-width default 2 instead of 4
					fill-column 80 ; fill-column default 80 chars
					global-hl-line-mode t ; highlight current line
					ring-bell-function 'ignore ;no beep
					undo-limit 67108864 ; increases undo limit 64mb.
					undo-strong-limit 100663296 ; 96mb.
					undo-outer-limit 1006632960 ; 960mb.
					sentence-end-double-space nil ;single space between sentences
					)

	;;----------------------------------------
	;; OS-specific configuration
  ;;----------------------------------------

	(when IS-WINDOWS (print "How did I get here?"))

	(when IS-MAC
		(setopt ns-pop-up-frames nil
						frame-resize-pixelwise t))
  )

(use-package exec-path-from-shell
  :disabled
	:defines	exec-path-from-shell-arguments
	exec-path-from-shell-variables
	exec-path-from-shell-initialize
	:hook (elpaca-after-init . exec-path-from-shell-initialize)
	:init
  (setq
   exec-path-from-shell-variables
	 '("PATH"
		 "MANPATH"
		 "GNUPGHOME"
		 "GPG_AGENT_INFO"
		 "HOMEBREW_CELLAR"
		 "HOMEBREW_PREFIX"
		 "HOMEBREW_REPOSITORY"
		 "INFOPATH"
		 "LANG"
		 "LC_CTYPE"
		 "NIX_SSL_CERT_FILE"
		 "NIX_PATH"
		 "SSH_AUTH_SOCK"
		 "SSH_AGENT_PID"
		 "XDG_CACHE_HOME"
		 "XDG_DATA_HOME"
		 "XDG_CONFG_HOME"
		 "XDG_STATE_HOME")
	 )
	)

(use-package dirvish
	:disabled
  :init
  (dirvish-override-dired-mode)
	:hook (dired-mode . dirvish-override-dired-mode)
  :custom
  (dirvish-quick-access-entries ; It's a custom option, `setq' won't work
   '(("h" "~/"                          "Home")
     ("d" "~/Downloads/"                "Downloads")
     ("m" "/mnt/"                       "Drives")
     ("s" "/ssh:my-remote-server")      "SSH server"
     ("e" "/sudo:root@localhost:/etc")  "Modify program settings"
     ("t" "~/.local/share/Trash/files/" "TrashCan")))
  :config
  ;; (dirvish-peek-mode)             ; Preview files in minibuffer
  ;; (dirvish-side-follow-mode)      ; similar to `treemacs-follow-mode'
  (setq dirvish-mode-line-format
        '(:left (sort symlink) :right (omit yank index)))
  (setq dirvish-attributes           ; The order *MATTERS* for some attributes
        '(vc-state subtree-state nerd-icons collapse git-msg file-time file-size)
        dirvish-side-attributes
        '(vc-state nerd-icons collapse file-size))
	(setq dired-mouse-drag-files t)                   ; added in Emacs 29
	(setq mouse-drag-and-drop-region-cross-program t) ; added in Emacs 29
	:general ; Bind `dirvish-fd|dirvish-side|dirvish-dwim' as you see fit
	(tyrant-def "fd" 'dirvish)
	(despot-def dirvish-mode-map
		:map dirvish-mode-map               ; Dirvish inherits `dired-mode-map'
		";"   'dired-up-directory        ; So you can adjust `dired' bindings here
		"?"   'dirvish-dispatch          ; [?] a helpful cheatsheet
		"a"   'dirvish-setup-menu        ; [a]ttributes settings:`t' toggles mtime, `f' toggles fullframe, etc.
		"f"   'dirvish-file-info-menu    ; [f]ile info
		"o"   'dirvish-quick-access      ; [o]pen `dirvish-quick-access-entries'
		"s"   'dirvish-quicksort         ; [s]ort flie list
		"r"   'dirvish-history-jump      ; [r]ecent visited
		"l"   'dirvish-ls-switches-menu  ; [l]s command flags
		"v"   'dirvish-vc-menu           ; [v]ersion control commands
		"*"   'dirvish-mark-menu
		"y"   'dirvish-yank-menu
		"N"   'dirvish-narrow
		"^"   'dirvish-history-last
		"TAB" 'dirvish-subtree-toggle
		"M-f" 'dirvish-history-go-forward
		"M-b" 'dirvish-history-go-backward
		"M-e" 'dirvish-emerge-menu
		)
	)

(use-package daemons
	:disabled)

(use-package eat
	:disabled)

(use-package surround
	:general
  (tyrant-def
		"Si" 'surround-insert
		"Sd" 'surround-kill
		"Sr" 'surround-replace)
	)

(use-package auth-source-1password)

;;; setup-emacs.el ends here

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
#+end_src

** setup-email.el
:PROPERTIES:
:CUSTOM_ID: setup-emailel
:END:
#+begin_src emacs-lisp :tangle config/setup-email.el
;;; config/setup-email.el --- Email configuration -*- lexical-binding: t -*-

(use-package mu4e
  :disabled)

(use-package notmuch
  :disabled)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-email.el ends here
#+end_src

** setup-evil-addons.el
:PROPERTIES:
:CUSTOM_ID: setup-evil-addonsel
:LAST_MODIFIED: [2025-07-19 Sat 20:48]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-evil-addons.el
;;; config/setup-evil-addons.el --- Evil addons configuration -*- lexical-binding: t -*-

(use-package evil-collection
	:hook (elpaca-after-init . evil-collection-init)
  :init
	(setq evil-collection-magit-want-horizontal-movement t
        evil-collection-unimpaired-want-repeat-mode-integration t)
  (add-hook 'org-agenda-mode-hook
            (lambda () (evil-collection-unimpaired-mode -1)))
  )

(use-package evil-org
  :hook (org-mode . evil-org-mode)
  :config
  (setopt evil-org-key-theme '(navigation insert textobjects additional todo heading))
  )

(use-package evil-snipe
  :hook (evil-mode . evil-snipe-mode)
	(evil-snipe-mode . evil-snipe-override-mode)
  :config
  (setopt evil-snipe-spillover-scope 'whole-buffer)
  (add-hook 'magit-mode-hook 'turn-off-evil-snipe-override-mode))

(use-package evil-surround
	:disabled
  :hook ((text-mode prog-mode conf-mode) . evil-surround-mode)
  :config
  (add-hook 'emacs-lisp-mode-hook
            (lambda ()
              (push '(?` . ("`" . "'")) evil-surround-pairs-alist)))
  (general-def 'visual evil-surround-mode-map
    "s" 'evil-surround-region
    "S" 'evil-substitute))

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-evil-addons.el ends here
#+end_src

** setup-evil.el
:PROPERTIES:
:CUSTOM_ID: setup-evilel
:END:
#+begin_src emacs-lisp :tangle config/setup-evil.el
;;; config/setup-evil.el --- Evil configuration -*- lexical-binding: t -*-

(use-package evil
  :ensure (:wait t)
  :demand t
  :hook ((elpaca-after-init . evil-mode)
         (prog-mode . hs-minor-mode)) ;why is this here?
  :init
  (setq evil-want-keybinding nil
        evil-symbol-word-search t
        evil-ex-search-vim-style-regexp t
        evil-search-module 'evil-search
        evil-magic 'very-magic
        evil-want-C-u-delete t
        evil-want-C-u-scroll t
        hs-minor-mode-map nil)
  :config
  (setopt evil-cross-lines t
        evil-kill-on-visual-paste nil
        evil-move-beyond-eol t
        evil-undo-system 'undo-redo
        evil-want-C-i-jump t
        evil-want-fine-undo t
        evil-v$-excludes-newline t
	 )
  (setopt evil-normal-state-cursor  '("DarkGoldenrod2" box)
        evil-insert-state-cursor  '("chartreuse3" (bar . 2))
        evil-emacs-state-cursor   '("SkyBlue2" box)
        evil-replace-state-cursor '("chocolate" (hbar . 2))
        evil-visual-state-cursor  '("gray" (hbar . 2))
        evil-motion-state-cursor  '("plum3" box))

  (evil-set-undo-system 'undo-redo)
  (define-key evil-inner-text-objects-map "P" 'evil-pasted)
  (define-key evil-inner-text-objects-map "g" 'evil-inner-buffer)

  (eldoc-add-command #'evil-normal-state
                     #'evil-insert
                     #'evil-change
                     #'evil-delete
                     #'evil-replace)
 (progn
    (evil-define-text-object evil-pasted (count &rest args)
      (list (save-excursion (evil-goto-mark ?\[) (point))
            (save-excursion (evil-goto-mark ?\]) (1+ (point)))))
    (define-key evil-inner-text-objects-map "P" 'evil-pasted)

    ;; define text-object for entire buffer
    (evil-define-text-object evil-inner-buffer (count &optional beg end type)
      (list (point-min) (point-max)))
    (define-key evil-inner-text-objects-map "g" 'evil-inner-buffer))

  (add-hook 'evil-normal-state-exit-hook #'evil-ex-nohighlight)
:general
	(general-def '(normal motion) "TAB" 'bicycle-cycle)
  (general-def 'normal "zf" 'reposition-window)
  (general-def 'insert [remap evil-complete-previous] 'hippie-expand)
	)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-evil.el ends here
#+end_src

