its-lit.org
** setup-font-locking.el
:PROPERTIES:
:CUSTOM_ID: setup-font-lockingel
:END:
#+begin_src emacs-lisp :tangle config/setup-font-locking.el
;;; config/setup-font-locking.el --- Font locking configuration -*- lexical-binding: t -*-

(use-package hl-todo
  :custom (global-hl-todo-mode 't))

(use-package highlight-parentheses
  :hook (prog-mode . highlight-parentheses-mode)
  :config
  ;; (setq highlight-parentheses-colors '("Springgreen3"
  ;;                                      "IndianRed1"
  ;;                                      "IndianRed3"
  ;;                                      "IndianRed4"))
  (set-face-attribute 'highlight-parentheses-highlight nil :weight 'ultra-bold))

(use-package rainbow-delimiters
	:disabled
  :hook (prog-mode . rainbow-delimiters-mode))



(use-package paren-face
	;; https://github.com/tarsius/paren-face
	;; Parentheses dimming
	;;	:hook (elisp-mode . paren-face-mode)
	:custom (global-paren-face-mode t)
	)

;;;
;; --- Font Locking Utilities ---
;;;

(use-package font-lock-studio
  ;; really useful when you need it, but doesn't need to be enabled most of the time
  :disabled)

(use-package highlight-refontification
  ;; really useful when you need it, but doesn't need to be enabled most of the time
  :disabled)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-font-locking.el ends here
#+end_src

** setup-go.el
:PROPERTIES:
:CUSTOM_ID: setup-goel
:END:
#+begin_src emacs-lisp :tangle config/setup-go.el
;;; config/setup-go.el --- Go programming language configuration -*- lexical-binding: t -*-

(use-package go-mode
  :mode ("\.go\"" . go-mode)
  :general
  (despot-def (go-mode-map)
    :major-modes '(go-mode go-ts-mode)
    "a" 'gofmt
    "f" (cons "jump" (make-sparse-keymap))
    "fa" 'go-goto-arguments
    "ff" 'go-goto-function
    "fn" 'go-goto-function-name
    "fr" 'go-goto-return-values
    "fm" 'go-goto-method-receiver
    )
	)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-go.el ends here
#+end_src

** setup-gopher.el
:PROPERTIES:
:CUSTOM_ID: setup-gopherel
:END:
#+begin_src emacs-lisp :tangle config/setup-gopher.el
;;; config/setup-gopher.el --- Gopher configuration -*- lexical-binding: t -*-

(use-package elpher
	:general
	(despot-def "ag" 'elpher))

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-gopher.el ends here
#+end_src
** Setup help and documentation viewers
:PROPERTIES:
:CUSTOM_ID: setup-help-and-documentation-viewers
:LAST_MODIFIED: [2025-07-18 Fri 04:11]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:

#+begin_src emacs-lisp :tangle config/setup-help.el
;;; config/setup-help.el --- helpful annotations -*- lexical-binding: t -*-

(use-package helpful
  :config
  (setq helpful-max-buffers 3
        helpful-switch-buffer-function #'helpful-reuse-window)

  (with-eval-after-load 'ibuffer
    (add-to-list 'ibuffer-help-buffer-modes 'helpful-mode))
  :general
  ([remap describe-command]  'helpful-command
   [remap describe-function] 'helpful-callable
   [remap describe-key]      'helpful-key
   [remap describe-symbol]   'helpful-symbol
   [remap describe-variable] 'helpful-variable))
;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-help.el ends here
#+end_src
** setup-icons.el
:PROPERTIES:
:CUSTOM_ID: setup-iconsel
:END:
#+begin_src emacs-lisp :tangle config/setup-icons.el
;;; config/setup-icons.el --- Icons configuration -*- lexical-binding: t -*-

(use-package nerd-icons-dired
  :hook  (dired-mode . nerd-icons-dired-mode)
  )

(use-package nerd-icons-ibuffer
  :hook (ibuffer-mode . nerd-icons-ibuffer-mode)
	:config
	(setopt
	 nerd-icons-ibuffer-icon t ; Whether display the icons.
	 nerd-icons-ibuffer-color-icon t ; Whether display the colorful icons.
	 ;; It respects `nerd-icons-color-icons'.
	 nerd-icons-ibuffer-icon-size 1.0
	 ;; The default icon size in ibuffer.
	 nerd-icons-ibuffer-human-readable-size t ; Use human readable file size in ibuffer.
	 ;; A list of ways to display buffer lines with `nerd-icons'.
	 ;; See `ibuffer-formats' for details.
	 ;; nerd-icons-ibuffer-formats

	 ;; Slow Rendering
	 ;; If you experience a slow down in performance when rendering multiple icons simultaneously,
	 ;; you can try setting the following variable
	 inhibit-compacting-font-caches t)
	)


(use-package tab-line-nerd-icons
	:hook (tab-line-mode . tab-line-nerd-icons-global-mode))

(use-package nerd-icons-corfu
	:disabled
;;	:if (global-corfu-mode) ; not defined if corfu isn't on. Need to figure out how to safely try this or an alternative condition
	:after corfu
	:init
	(add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter)
;;	:hook (corfu-mode . nerd-icons-completion)
;; ;; Optionally:
;; (setq nerd-icons-corfu-mapping
;;       '((array :style "cod" :icon "symbol_array" :face font-lock-type-face)
;;         (boolean :style "cod" :icon "symbol_boolean" :face font-lock-builtin-face)
;;         ;; ...
;;         (t :style "cod" :icon "code" :face font-lock-warning-face)))
;;         ;; Remember to add an entry for `t', the library uses that as default.
;; The Custom interface is also supported for tuning the variable above.
	)

(use-package all-the-icons
	:disabled
  :if (display-graphic-p))

(use-package all-the-icons-dired
	:disabled
  :after all-the-icons
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package all-the-icons-ibuffer
	:disabled
  :after all-the-icons
  :hook (ibuffer-mode . all-the-icons-ibuffer-mode))

(use-package kind-icon
	:disabled
  :after corfu
  :custom
   (kind-icon-blend-background t)
   (kind-icon-default-face 'corfu-default) ; only needed with blend-background
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))

(use-package nerd-icons
	;;	:hook (doom-modeline-mode)
	:custom (nerd-icon-scale-factor 0.8)
)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-icons.el ends here
#+end_src

** setup-lisp.el
:PROPERTIES:
:CUSTOM_ID: setup-lispel
:END:
#+begin_src emacs-lisp :tangle config/setup-lisp.el
;;; config/setup-lisp.el --- Lisp configuration -*- lexical-binding: t -*-

(use-package slime
	:hook (elisp-mode . slime-mode)
  :config
	(setopt inferior-lisp-program "sbcl")
	(add-hook 'slime-mode-hook (setq-local lsp-bridge-mode -1))
  (despot-def (slime-mode-map)
    :major-modes 'slime-mode
    "b" 'slime-eval-buffer
    "c" 'slime-compile-defun
    "k" 'slime-compile-and-load-file
    "f"  'ad-Advice-slime-eval-defun
    "r" 'slime-eval-region
    )
  )

(use-package elisp-mode
  :ensure nil
  :config
  (despot-def :keymaps '(emacs-lisp-mode-map lisp-interaction-mode-map)
    "'"  'ielm
    "c"  (cons "compile" (make-sparse-keymap))
    "cc" 'emacs-lisp-byte-compile
    "e"  (cons "eval" (make-sparse-keymap))
    "eb" 'eval-buffer
    "ee" 'eval-last-sexp
    "er" 'eval-region
    "ef" 'eval-defun
    "t"  (cons "tests" (make-sparse-keymap))
    "tb" 'ert-run-tests-buffer
    "tq" 'ert))

(use-package racket-mode
	:mode ("\\.rkt\\" . racket-mode)
	)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-lisp.el ends here
#+end_src

** setup-llm.el
:PROPERTIES:
:CUSTOM_ID: setup-llmel
:END:
#+begin_src emacs-lisp :tangle config/setup-llm.el
;;; config/setup-llm.el --- LLM configuration -*- lexical-binding: t -*-

(use-package llm
  :config
  (use-package llm-openai
    :ensure nil)

  (use-package llm-claude
    :ensure nil)
  )

(use-package ellama
  :disabled
  :after llm
  :config
  (setopt ellama-provider (make-llm-openai-compatible
			   :url "http://127.0.0.1:1234"))
  )


(use-package gptel
  :functions gptel--insert-file-string
  :config
  (setopt gptel-model   'llama-cpp
          gptel-backend (gptel-make-openai "llama-cpp"
                          :stream t
                          :protocol "http"
                          :host "localhost:1234"
                          :models '(llama-cpp)))

  (gptel-make-openai "OpenRouter"               
    :host "openrouter.ai"
    :endpoint "/api/v1/chat/completions"
    :stream t
    :key (gptel-api-key-from-auth-source "api.openrouter.ai" "apikey")
    :models '(google/gemini-2.5-flash
	      google/gemini-2.5-pro
              openrouter/auto
	      anthropic/claude-sonnet-4
              deepseek/deepseek-r1-0528:free
              deepseek/deepseek-prover-v2:free
	      open-r1/olympiccoder-32b:free
	      mistralai/devstral-small:free
              google/gemma-3-27b-it:free
	      deepseek/deepseek-r1-zero:free
	      qwen/qwq-32b:free)
    )

  (gptel-make-anthropic "Claude"          
    :stream t
    :key (gptel-api-key-from-auth-source "api.anthropic.com" "apikey")
    )

  (gptel-make-gemini "Gemini-API"
    :stream t
    :key (gptel-api-key-from-auth-source "generativelanguage.googleapis.com" "apikey")
    )

  )

(use-package aidermacs
  :general (tyrant-def "aa" 'aidermacs-transient-menu)
  :config
  (setopt aidermacs-backend 'vterm)
  (setenv "GEMINI_API_KEY" (gptel-api-key-from-auth-source "generativelanguage.googleapis.com" "apikey"))
  (setenv "ANTHROPIC_API_KEY" (gptel-api-key-from-auth-source "api.anthropic.com" "apikey"))
  (setenv "OPENROUTER_API_KEY" (gptel-api-key-from-auth-source "api.openrouter.ai" "apikey"))
  (setenv "LM_STUDIO_API_KEY" "dummy-api-key")
  (setenv "LM_STUDIO_API_BASE" "http://localhost:1234/v1") 
  :custom
  (aidermacs-use-architect-mode t)
  (aidermacs-default-model "gemini/gemini-pro-2.5")
  )

(use-package forge-llm
  :disabled
  :after forge llm
  :custom
  (forge-llm-llm-provider
   (make-llm-claude
    :key (auth-source-pick-first-password
	  :host "api.anthropic.com"
	  :user "apikey")
    :chat-model "claude-3-7-sonnet-20250219"
    )
   )
  :config
  (forge-llm-setup)
  :general
  (tyrant-def
    "gg" 'forge-llm-generate-pr-description
    "gp" 'forge-llm-generate-pr-description-at-point
    "gt" 'forge-llm-insert-template-at-point
    )
  )

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-llm.el ends here
#+end_src

** setup-lsp-bridge.el
:PROPERTIES:
:CUSTOM_ID: setup-lsp-bridgeel
:LAST_MODIFIED: [2025-07-18 Fri 20:32]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-lsp-bridge.el
;;; config/setup-lsp-bridge.el --- lsp-bridge configuration -*- lexical-binding: t -*-

(require 'my-lsp-bridge-helpers)

(use-package lsp-bridge
  :after yasnippet
  :ensure (lsp-bridge
           :type git :host github :repo "manateelazycat/lsp-bridge"
           :files (:defaults "*.el" "*.py" "acm" "core" "langserver" "multiserver" "resources")
           :build (:not elpaca--byte-compile)
           )
  :init
  (setq lsp-bridge-python-command lsp-bridge-python-path)

  :hook (elpaca-after-init . global-lsp-bridge-mode)
  :config
  (setopt toml-indent-offset 2
          lsp-bridge-enable-completion-in-minibuffer t)
  :custom (global-lsp-bridge-mode t)

  (use-package acm
    :hook lsp-bridge-mode
    :ensure nil
    :config (setopt acm-mode t)
    )
  )

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-lsp-bridge.el ends here
#+end_src

