its-lit.org
** setup-lsp.el
:PROPERTIES:
:CUSTOM_ID: setup-lspel
:END:
#+begin_src emacs-lisp :tangle config/setup-lsp.el
;;; config/setup-lsp.el --- LSP configuration -*- lexical-binding: t -*-

(use-package eglot
	:disabled
;  :commands expand-absolute-name
  :init
  (setq read-process-output-max (* 1024 1024))

  ;; (defun expand-absolute-name (name)
  ;;   (if (file-name-absolute-p name)
  ;;       (tramp-file-local-name
  ;;        (expand-file-name
  ;;         (concat (file-remote-p default-directory) name)))
  ;;     name))

  (general-def eglot--managed-mode
    :states '(normal insert motion emacs)
    :keymaps 'override
    :prefix-map 'tyrant-eglot-map
    :definer 'minor-mode
    :prefix "SPC"
    :non-normal-prefix "S-SPC"
    "ce"  (cons "eglot" (make-sparse-keymap))
    "cea" 'eglot-code-actions
    "ceb" 'eglot-events-buffer
    "cer" 'eglot-rename
    "ceR" 'eglot-reconnect
    "cex" 'eglot-shutdown
    "ceX" 'eglot-shutdown-all
    "ce=" 'eglot-format)
  :general
  (tyrant-def "cE" 'eglot))


(use-package consult-eglot
	:disabled
  :after eglot consult)

(use-package consult-eglot-embark
	:disabled
	:after consult eglot embark
  :hook ('eglot-ensure . consult-eglot-embark-mode))


(use-package eldoc-box
	:disabled ;slow, try again with lsp-bridge
  :hook (eglot-managed-mode . eldoc-box-hover-mode))

(use-package dape
	:disabled

	  :hook (dape-mode . repeat-mode)
  ;; Enable repeat mode for more ergonomic `dape' use
;;  :preface
  ;; By default dape shares the same keybinding prefix as `gud'
  ;; If you do not want to use any prefix, set it to nil.
  ;; (setq dape-key-prefix "\C-x\C-a")

;;  :hook
  ;; Save breakpoints on quit
  ;; (kill-emacs . dape-breakpoint-save)
  ;; Load breakpoints on startup
  ;; (after-init . dape-breakpoint-load)

  :config
  ;; Turn on global bindings for setting breakpoints with mouse
  ;; (dape-breakpoint-global-mode)

  ;; Info buffers to the right
  (setopt dape-buffer-window-arrangement 'right)

  ;; Info buffers like gud (gdb-mi)
  ;; (setq dape-buffer-window-arrangement 'gud)
  ;; (setq dape-info-hide-mode-line nil)

  ;; Pulse source line (performance hit)
  (add-hook 'dape-display-source-hook 'pulse-momentary-highlight-one-line)

  ;; Showing inlay hints
  ;; (setq dape-inlay-hints t)

  ;; Save buffers on startup, useful for interpreted languages
  (add-hook 'dape-start-hook (lambda () (save-some-buffers t t)))

  ;; Kill compile buffer on build success
  ;; (add-hook 'dape-compile-hook 'kill-buffer)

  ;; Projectile users
  ;; (setq dape-cwd-function 'projectile-project-root)
)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-lsp.el ends here
#+end_src

** setup-markdown.el
:PROPERTIES:
:CUSTOM_ID: setup-markdownel
:LAST_MODIFIED: [2025-07-18 Fri 22:33]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-markdown.el
;;; config/setup-markdown.el --- Markdown configuration -*- lexical-binding: t -*-
;;; Commentary:
;;; Code:
(use-package markdown-mode
  :mode ("README\\.md\\'" . gfm-mode)
        ("\\.qmd\\'" . markdown-mode)
  :init (setq markdown-command "multimarkdown")
  :config
  (setopt markdown-fontify-code-blocks-natively t)
  :general
  (despot-def markdown-mode-map
    "RET"   'markdown-do
    "M-RET" 'markdown-insert-list-item
    "{"     'markdown-backward-paragraph
    "}"     'markdown-forward-paragraph
    "]"     'markdown-complete
    ">"     'markdown-indent-region
    "<"     'markdown-outdent-region
    "-"     'markdown-insert-hr
    "c"     (cons "command" (make-sparse-keymap))
    "c]"    'markdown-complete-buffer
    "cc"    'markdown-check-refs
    "ce"    'markdown-export
    "cm"    'markdown-other-window
    "cn"    'markdown-cleanup-list-numbers
    "co"    'markdown-open
    "cp"    'markdown-preview
    "cv"    'markdown-export-and-preview
    "cw"    'markdown-kill-ring-save
    "f"     'markdown-follow-thing-at-point
    "h"     (cons "header" (make-sparse-keymap))
    "hi"    'markdown-insert-header-dwim
    "hI"    'markdown-insert-header-setext-dwim
    "h1"    'markdown-insert-header-atx-1
    "h2"    'markdown-insert-header-atx-2
    "h3"    'markdown-insert-header-atx-3
    "h4"    'markdown-insert-header-atx-4
    "h5"    'markdown-insert-header-atx-5
    "h6"    'markdown-insert-header-atx-6
    "h!"    'markdown-insert-header-setext-1
    "h@"    'markdown-insert-header-setext-2
    "i"     (cons "insert" (make-sparse-keymap))
    "if"    'markdown-insert-footnote
    "ii"    'markdown-insert-image
    "il"    'markdown-insert-link
    "iw"    'markdown-insert-wiki-link
    "iu"    'markdown-insert-uri
    "k"     'markdown-kill-thing-at-point
    "N"     'markdown-next-link
    "l"     (cons "lists" (make-sparse-keymap))
    "li"    'markdown-insert-list-item
    "P"     'markdown-previous-link
    "t"     (cons "table" (make-sparse-keymap))
    "tp"    'markdown-table-move-row-up
    "tn"    'markdown-table-move-row-down
    "tf"    'markdown-table-move-column-right
    "tb"    'markdown-table-move-column-left
    "tr"    'markdown-table-insert-row
    "tR"    'markdown-table-delete-row
    "tc"    'markdown-table-insert-column
    "tC"    'markdown-table-delete-column
    "ts"    'markdown-table-sort-lines
    "td"    'markdown-table-convert-region
    "tt"    'markdown-table-transpose
    "T"     (cons "toggles" (make-sparse-keymap))
    "Ti"    'markdown-toggle-inline-images
    "Tl"    'markdown-toggle-url-hiding
    "Tm"    'markdown-toggle-markup-hiding
    "Tt"    'markdown-toggle-gfm-checkbox
    "Tw"    'markdown-toggle-wiki-links
    "x"     (cons "text" (make-sparse-keymap))
    "xb"    'markdown-insert-bold
    "xB"    'markdown-insert-gfm-checkbox
    "xc"    'markdown-insert-code
    "xC"    'markdown-insert-gfm-code-block
    "xi"    'markdown-insert-italic
    "xk"    'markdown-insert-kbd
    "xp"    'markdown-insert-pre
    "xq"    'markdown-insert-blockquote
    "xs"    'markdown-insert-strike-through
    "xQ"    'markdown-blockquote-region
    "xP"    'markdown-pre-region)

  (general-def '(normal insert) markdown-mode-map
    "M-h"      'markdown-promote
    "M-j"      'markdown-move-down
    "M-k"      'markdown-move-up
    "M-l"      'markdown-demote)
  )

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-markdown.el ends here
#+end_src

** setup-media.el
:PROPERTIES:
:CUSTOM_ID: setup-mediael
:END:
#+begin_src emacs-lisp :tangle config/setup-media.el
;;; config/setup-media.el --- Media players configuration -*- lexical-binding: t -*-

(use-package ready-player
	:general
	(tyrant-def "ar" 'ready-player-view-player)
	:config
	(ready-player-mode +1)
	)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-media.el ends here
#+end_src

** setup-modeline.el
:PROPERTIES:
:CUSTOM_ID: setup-modelineel
:END:
#+begin_src emacs-lisp :tangle config/setup-modeline.el
;;; config/setup-modeline.el --- Modeline configuration -*- lexical-binding: t -*-

(use-package doom-modeline
  :hook (elpaca-after-init . doom-modeline-mode)
  :config
  (setopt inhibit-compacting-font-caches t
          doom-modeline-buffer-encoding nil
          doom-modeline-height 0
          doom-modeline-buffer-file-name-style 'auto
          doom-modeline-project-detection 'project
          doom-modeline-icon t
          doom-modeline-major-mode-icon nil
          doom-modeline-modal-icon nil
          doom-modeline-gnus nil
          doom-modeline-irc nil
          doom-modeline-persp-name nil
          )
  )

(use-package moody
  :disabled
  :config
  (moody-replace-mode-line-front-space)
  (moody-replace-mode-line-buffer-identification)
  (moody-replace-vc-mode)
  )

(use-package nano-modeline
  :disabled)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-modeline.el ends here
#+end_src

** setup-notes.el
:PROPERTIES:
:CUSTOM_ID: setup-notesel
:END:
#+begin_src emacs-lisp :tangle config/setup-notes.el
;;; config/setup-notes.el --- Notes configuration -*- lexical-binding: t -*-

(use-package obsidian
  :config
	(setopt obsidian-directory "~/obsidian"
					obsidian-inbox-directory "Inbox"
					obsidian-daily-notes-directory "Notes/Time-based Notes/Daily Notes"
					obsidian-templates-directory "Resources/Templates"
					obsidian-daily-note-template "Resources/Templates/Daily Note Template"
					global-obsidian-mode t
					obsidian-backlinks-mode nil)

	:general
	(tyrant-def "aob" 'obsidian-toggle-backlinks-panel)
  )

(use-package annotate
	:disabled
	:general
	(tyrant-def "aa" 'annotate-mode)
	)

(use-package orgmdb
	:disabled
  )

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-notes.el ends here
#+end_src

** Outline and fold text
:PROPERTIES:
:CUSTOM_ID: outline-and-fold-text
:LAST_MODIFIED: [2025-07-18 Fri 02:35]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-outlining.el
;;; setup-outlining.el ---  -*- lexical-binding: t; -*-
(use-package outline-minor-faces
  :after outline
  :config (add-hook 'outline-minor-mode-hook
                    #'outline-minor-faces-mode)
  )

(use-package backline
  :after outline
  :config (advice-add 'outline-flag-region :after 'backline-update)
  )

(use-package outline-indent
  :commands outline-indent-minor-mode
  :custom
  (outline-indent-ellipsis "  ")
  :general
  (tyrant-def
    "to" 'outline-indent-minor-mode
    "o"  (cons "outline" (make-sparse-keymap))
    "oa" '("all open" . outline-indent-open-folds)
    "oA" '("all closed" . outline-indent-close-folds)
    "ob" 'bicycle-cycle
    "oB" 'bicycle-cycle-global
    "oc" 'outline-indent-close-fold
    "oj" 'outline-forward-same-level
    "ok" 'outline-backward-same-level
    "oh" 'hs-minor-mode
    "oo" 'outline-indent-open-fold
    "oO" 'outline-minor-mode
    "or" 'outline-indent-open-fold-rec
    "ot" 'bicycle-cycle
    "oT" 'bicycle-cycle-global
    "oz" 'TeX-fold-mode)
  )

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-outlining.el ends here
#+end_src

** setup-programming.el
:PROPERTIES:
:CUSTOM_ID: setup-programmingel
:LAST_MODIFIED: [2025-07-18 Fri 04:57]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-programming.el
;;; config/setup-programming.el --- General programming tools configuration -*- lexical-binding: t -*-

(use-package apheleia
  :disabled
  :custom (apheleia-global-mode nil)
  )

(use-package editorconfig
	:disabled 
  :config
  (editorconfig-mode nil)
	:general
	(tyrant-def "ce" 'editorconfig-mode)
	)

(use-package typespec-ts-mode
	:mode ("\\.tsp\\'" . typespec-ts-mode)
	:config
	(add-to-list
 'treesit-language-source-alist
 '(typespec "https://github.com/happenslol/tree-sitter-typespec"))
	)

(use-package code-cells
	:disabled
	:mode ("\\([ipynb]\\)\\'" . code-cells-mode))

(use-package drepl
	:disabled
	:general
	(trant-def "ci" 'drepl-ipython))

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-programming.el ends here
#+end_src

