its-lit.org
** setup-projects.el
:PROPERTIES:
:CUSTOM_ID: setup-projectsel
:END:
#+begin_src emacs-lisp :tangle config/setup-projects.el
;;; config/setup-projects.el --- Projects configuration -*- lexical-binding: t -*-

(use-package todoist
	:disabled
  :config
  (setq todoist-backing-buffer "~/obsidian/org/todoist")

  (despot-def todoist-mode-map
    "t"     'todoist-task-menu
    "p"     'todoist-project-menu
    "n"     'todoist-new-task
    "c"      'todoist-close-task
    "u"      'todoist-update-task
    "U"      'todoist-update-project)

  )

(use-package bookmark-in-project)

(use-package chronometrist)


(use-package disproject
  ;; Replace `project-prefix-map' with `disproject-dispatch'.
  :bind ( :map ctl-x-map
          ("p" . disproject-dispatch)))

(use-package perject
	:disabled)

(use-package perpsective
	:disabled)

(use-package projection
  :disabled
  ;; Enable the `projection-hook' feature.
  :hook (elpaca-after-init . global-projection-hook-mode)

  ;; Require projections immediately after project.el.
  :config
  (with-eval-after-load 'project
    (require 'projection))

  :config
  ;; Uncomment if you want to disable prompts for compile commands customized in .dir-locals.el
  ;; (put 'projection-commands-configure-project 'safe-local-variable #'stringp)
  ;; (put 'projection-commands-build-project 'safe-local-variable #'stringp)
  ;; (put 'projection-commands-test-project 'safe-local-variable #'stringp)
  ;; (put 'projection-commands-run-project 'safe-local-variable #'stringp)
  ;; (put 'projection-commands-package-project 'safe-local-variable #'stringp)
  ;; (put 'projection-commands-install-project 'safe-local-variable #'stringp)

  ;; Access pre-configured projection commands from a keybinding of your choice.
  ;; Run `M-x describe-keymap projection-map` for a list of available commands.
  :bind-keymap
  ("C-x P" . projection-map))

(use-package projection-multi
  :disabled
  ;; Allow interactively selecting available compilation targets from the current
  ;; project type.
  :bind ( :map project-prefix-map
          ("RET" . projection-multi-compile)))

(use-package projection-multi-embark
  :disabled
  :after embark
  :after projection-multi
  ;; Add the projection set-command bindings to `compile-multi-embark-command-map'.
  :config (projection-multi-embark-setup-command-map))

(use-package tabspaces
  :after consult
  :hook (tab-bar-mode . tabspaces-mode) 
  :commands (tabspaces-switch-or-create-workspace
             tabspaces-open-or-create-project-and-workspace)
  :custom
  (tabspaces-use-filtered-buffers-as-default t)
  (tabspaces-default-tab "Default")
  (tabspaces-remove-to-default t)
  (tabspaces-include-buffers '("*scratch*"))
  (tabspaces-initialize-project-with-todo t)
  (tabspaces-todo-file-name "project-todo.org")
  ;; sessions
  (tabspaces-session t)
  (tabspaces-session-auto-restore nil)
  (tab-bar-new-tab-choice "*scratch*")
	:config
	;; Filter Buffers for Consult-Buffer
	(with-eval-after-load 'consult
		;; hide full buffer list (still available with "b" prefix)
		(consult-customize consult--source-buffer :hidden t :default nil)
		;; set consult-workspace buffer list
		(add-to-list 'consult-buffer-sources 'consult--source-workspace)
		)

	(add-hook 'tabspaces-mode-hook #'my--consult-tabspaces)
	(setopt tabspaces-session-project-session-store "~/.emacs.d/var/tabspaces-sessions/")
  )

(use-package activities
  :disabled
	:init
  (activities-mode)
  (activities-tabs-mode)
  (setq edebug-inhibit-emacs-lisp-mode-bindings t)

  :bind
  (("C-x C-a C-n" . activities-new)
   ("C-x C-a C-d" . activities-define)
   ("C-x C-a C-a" . activities-resume)
   ("C-x C-a C-s" . activities-suspend)
   ("C-x C-a C-k" . activities-kill)
   ("C-x C-a RET" . activities-switch)
   ("C-x C-a b" . activities-switch-buffer)
   ("C-x C-a g" . activities-revert)
   ("C-x C-a l" . activities-list))
	)

(use-package buffler
	:disabled
	)

(use-package perspective
	:disabled
  :bind
  ("C-x C-b" . persp-list-buffers)
  :custom
  (persp-mode-prefix-key (kbd "C-c M-p"))
  :init
  (persp-mode))

(use-package burly
	:disabled
	)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-projects.el ends here
#+end_src

** setup-reading.el
:PROPERTIES:
:CUSTOM_ID: setup-readingel
:LAST_MODIFIED: [2025-07-18 Fri 18:40]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-reading.el
;;; config/setup-reading.el --- Reading tools -*- lexical-binding: t -*-

(use-package djvu)

(use-package nov
	:mode ("\\.epub\\'" . nov-mode)
	:hook (nov-mode . visual-line-fill-column-mode)
	:config
;; Want this only in nov-mode with variable pitch font, not the right way to do        
;;	(setq-local visual-fill-column-width 60)
        (setopt nov-text-width t
                visual-fill-column-center-text t)
        )

(use-package pdf-tools
  :ensure (:post-build (pdf-tools-install))
  :mode ("\\.pdf\\'" . pdf-view-mode)
  :hook (pdf-view-mode . (lambda () (visual-fill-column-mode -1)))
  :init
  (setopt pdf-view-display-size 'fit-page
          pdf-view-resize-factor 1.1
          pdf-annot-activate-created-annotations t
          pdf-view-use-unicode-ligther nil
          )
)

;; Structure and Interpretation of Computer Programs as info file
(use-package sicp)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-reading.el ends here
#+end_src

*** Removed reading packages
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 18:34]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:header_args: :eval no :tangle no :noweb no
:END:

#+begin_src emacs-lisp :eval no :tangle no :noweb no
(use-package wallabag
  :disabled
  :load-path "~/.emacs.d/lisp/wallabag/"
  :config
  (setq wallabag-host "https://xx.xx.xx")
  (setq wallabag-username "xx")
  (setq wallabag-password "xx")
  (setq wallabag-clientid "xx")
  (setq wallabag-secret "xx")
  (setq wallabag-search-print-items '("title" "domain" "tag" "reading-time" "date"))
(setq wallabag-search-page-max-rows 32)
  )

(use-package zotxt
	:disabled)

(use-package pocket-reader
	:disabled)

(use-package biblio
	:disabled)

(use-package arxiv-mode
	:disabled)

(use-package calibredb
	:disabled)

(use-package devdocs
	:general
	(tyrant-def
		"Jm" 'devdocs-lookup
		"JM" 'devdocs-peruse
		"hd" 'devdocs-peruse)
	)

(use-package dash-docs
	:disabled)

(use-package consult-dash
	:disabled
  :after (consult dash-docs)
	:general
	(tyrant-def
		"Jm" 'consult-dash)
  :config
   (consult-customize consult-dash :initial (thing-at-point 'symbol))
	)
#+end_src
** setup-search.el
:PROPERTIES:
:CUSTOM_ID: setup-searchel
:LAST_MODIFIED: [2025-07-18 Fri 21:18]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-search.el
;;; config/setup-search.el --- Search tools configuration -*- lexical-binding: t -*-

(use-package rg
  :config (when (and IS-MAC (daemonp)) (setopt rg-executable "/opt/homebrew/bin/rg"))
  :general (tyrant-def   "fr" 'rg
                         "fR" 'rg-menu
             )
	)

(use-package wgrep
  :disabled)

(use-package manage-minor-mode-table
  :disabled
  :general
  (tyrant-def "am" 'manage-minor-mode-table)
 )

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-search.el ends here
#+end_src

** setup-snippets.el
:PROPERTIES:
:CUSTOM_ID: setup-snippetsel
:LAST_MODIFIED: [2025-07-18 Fri 05:00]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-snippets.el
;;; config/setup-snippets.el --- Snippets configuration -*- lexical-binding: t -*-

(use-package tempel
  :hook ((text-mode prog-mode) . tempel-setup-capf)
  :init
  (setq tempel-trigger-prefix "<"
        tempel-path "~/.emacs.d/etc/templates/*.eld")
  :config
(defun tempel-setup-capf ()
  (setq-local completion-at-point-functions
              (cons #'tempel-complete
                    completion-at-point-functions)))

(defun tempel-hippie-try-expand (old)
  "Integrate with hippie expand.
Just put this function in `hippie-expand-try-functions-list'."
  (if (not old)
      (tempel-expand t)
    (undo 1)))


  (add-to-list 'hippie-expand-try-functions-list #'tempel-hippie-try-expand t)

	;;	:custom
	;;	(tempel-auto-reload nil)
	;; I don't want unexpected changes if I update something from a template, but
	;; I think I should use tempel-done when I'm done with a template
	)

(use-package tempel-collection
  :after tempel)

(use-package eglot-tempel
	:disabled
  :hook (eglot-managed-mode .  eglot-tempel-mode)
	)

(use-package yasnippet
	:hook ((text-mode prog-mode) . yas-minor-mode)
	:config
	(setopt yas-global-mode t)
	)

(use-package yasnippet-snippets
	:after yasnippet)
;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-snippets.el ends here
#+end_src

