its-lit.org
** setup-treesit.el
:PROPERTIES:
:CUSTOM_ID: setup-treesitel
:END:
#+begin_src emacs-lisp :tangle config/setup-treesit.el
;;; config/setup-treesit.el --- Treesitter configuration -*- lexical-binding: t -*-

(use-package treesit
  :ensure nil
	:defer t
	:config
	(setq treesit-language-source-alist
				'(
					(r "https://github.com/r-lib/tree-sitter-r" "next")
					(bash "https://github.com/tree-sitter/tree-sitter-bash")
					(cmake "https://github.com/uyha/tree-sitter-cmake")
					(css "https://github.com/tree-sitter/tree-sitter-css")
					(elisp "https://github.com/Wilfred/tree-sitter-elisp")
					(go "https://github.com/tree-sitter/tree-sitter-go")
					(html "https://github.com/tree-sitter/tree-sitter-html")
					(javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
					(json "https://github.com/tree-sitter/tree-sitter-json")
					(make "https://github.com/alemuller/tree-sitter-make")
					(markdown "https://github.com/ikatyang/tree-sitter-markdown")
					(python "https://github.com/tree-sitter/tree-sitter-python")
					(toml "https://github.com/tree-sitter/tree-sitter-toml")
					(tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
					(typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
					(yaml "https://github.com/ikatyang/tree-sitter-yaml")))
	)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-treesit.el ends here
#+end_src

** Configure UI Elements
:PROPERTIES:
:CUSTOM_ID: configure-ui-elements
:END:

** setup-ui.el
:PROPERTIES:
:CUSTOM_ID: setup-uiel
:LAST_MODIFIED: [2025-07-18 Fri 23:06]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-ui.el
;;; config/setup-ui.el --- UI configuration -*- lexical-binding: t -*-
;;; Commentary:
;;; Code:

(use-package mct
  :disabled
  :hook (vertico-mode . mct-mode))

(use-package bicycle
  :hook ((prog-mode . outline-minor-mode)
         (prog-mode . hs-minor-mode))
  :general (tyrant-def
             "t TAB" 'bicycle-cycle
             "t <backtab>" 'bicycle-cycle-global
             )
  )

(use-package focus
  :disabled
  :general
  (tyrant-def "tF" 'focus-mode)
  )

(use-package indent-control
  :disabled)

(use-package nocomments-mode
  :disabled
  :general (tyrant-def "tc" 'nocomments-mode)
  )

(use-package olivetti
  :hook ((text-mode prog-mode org-mode) . olivetti-mode)
  :config (setopt olivetti-style 'fancy
                  olivetti-body-width 0.7
                  olivetti-minimum-body-width 80
                  olivetti-recall-visual-line-mode-entry-state t
                  )
  )


(use-package shackle
  :config
  (setopt shackle-mode t
          shackle-default-size 0.2
          shackle-rules
          `((help-mode :select t :align right :size 0.33)
            (helpful-mode :select t :align right :size 0.33)
            ("*Messages*"                    :select t :align t)
            ("*eldoc*"                       :align t)
            (special-mode                    :align t)
            (process-menu-mode               :align t)
            (compilation-mode                :align t)
            (flymake-diagnostics-buffer-mode :align t)
            ("*Shell Command Output*"        :align t :size 2)
            ("*Async Shell Command*"         :align t :size 2)
            ("*elpaca-info*" :align t)
            ))
  )

(use-package spacious-padding
  :hook elpaca-after-init
  :config (setopt spacious-padding-subtle-frame-lines t
                  spacious-padding-widths '(:internal-border-width 10
                                            :header-line-width 4
                                            :mode-line-width 4
                                            :tab-width 4
                                            :right-divider-width 0
                                            :scroll-bar-width 4
                                            :fringe-width 8)
                  )
  )


(use-package visual-fill-column
  :hook (elpaca-after-init . global-visual-fill-column-mode)
  :config (setopt visual-fill-column-center-text t
                  visual-fill-column-extra-text-width '(4 . 4)
                  fill-column 80
                  )
  )

(use-package writeroom-mode
  :disabled
  :config
  (setq split-width-threshold 120
        writeroom-width 128
        writeroom-fringes-outside-margins nil
        writeroom-global-effects nil
        writeroom-major-modes-exceptions '(process-menu-mode proced-mode backtrace-mode)
        writeroom-maximize-window t
        writeroom-mode-line t
        writeroom-mode-line-toggle-position 'mode-line-format)
  :general
  (tyrant-def
    "wc" 'writeroom-mode
    "wC" 'global-writeroom-mode))

(use-package logos
  :disabled
  )
(use-package calle24
  :disabled
  :hook (compilation-mode . calle24-refresh-appearance)
  :config
  (calle24-refresh-appearance)
  )

(use-package activities
  :disabled
  :init
  (activities-mode)
  (activities-tabs-mode)
  (setq edebug-inhibit-emacs-lisp-mode-bindings t)

  :bind
  (("C-x C-a C-n" . activities-new)
   ("C-x C-a C-d" . activities-define)
   ("C-x C-a C-a" . activities-resume)
   ("C-x C-a C-s" . activities-suspend)
   ("C-x C-a C-k" . activities-kill)
   ("C-x C-a RET" . activities-switch)
   ("C-x C-a b" . activities-switch-buffer)
   ("C-x C-a g" . activities-revert)
   ("C-x C-a l" . activities-list)))

(use-package golden-ratio
  :disabled
  :config (setopt golden-ratio-mode nil)
  )

(use-package zoom
  :disabled)

(use-package eyebrowse
  :disabled)

(use-package popper
  :config
  (setopt popper-display-control nil
          popper-reference-buffers
          '("\*Messages\*"
            "Output\*$"
            "\*Async Shell Command\*"
            "\*eldoc\*"
            "^\*EGLOT"
            help-mode
            helpful-mode
            compilation-mode
            process-menu-mode
            special-mode
            flymake-diagnostics-buffer-mode))
  :general
  (tyrant-def
    ";" '("pop toggle" . popper-toggle)
    ":" '("pop kill" . popper-kill-latest-popup))
  :custom
  (popper-mode 1)
  (popper-echo-mode 1)
  )

(use-package sideline
  :hook (flymake-mode . sideline-mode)
  )

(use-package sideline-flymake
    :init
    (setq sideline-backends-right '(sideline-flymake))
    (add-hook 'flymake-mode-hook
              (lambda () (remove-hook 'eldoc-documentation-functions 'flymake-eldoc-function t))
              )
    )

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-ui.el ends here
#+end_src

** setup-vc.el
:PROPERTIES:
:CUSTOM_ID: setup-vcel
:LAST_MODIFIED: [2025-07-18 Fri 22:00]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle config/setup-vc.el
;;; config/setup-vc.el --- Version control configuration -*- lexical-binding: t -*-

(use-package vc
  :ensure nil
  :config
  (setopt vc-follow-symlinks t)
  )

(use-package magit
  :init (setq magit-define-global-key-bindings nil
              forge-add-default-bindings nil
              )
  :hook (magit-diff-mode . (lambda () (toggle-truncate-lines -1)))
  :config
  (setopt magit-diff-refine-hunk t
        magit-display-buffer-function 'magit-display-buffer-same-window-except-diff-v1
        magit-revision-show-gravatars '("^Author:     " . "^Commit:     ")
        magit-save-repository-buffers 'dontask
        magit-wip-after-apply-mode t
        magit-wip-after-save-mode t
        magit-wip-before-change-mode t
        magit-wip-initial-backup-mode t
        magit-wip-merge-branch t
        magit-wip-mode t
        )

  (advice-add 'magit-blame-addition           :after #'org-reveal-advice)
  (advice-add 'magit-diff-visit-file          :after #'org-reveal-advice)
  (advice-add 'magit-diff-visit-worktree-file :after #'org-reveal-advice)

  :general
  (tyrant-def "g" (cons "git" (make-sparse-keymap))
    "gb"  'magit-blame
    "gc"  'magit-clone
    "gd"  'magit-diff
    "gf"  'magit-file-dispatch
    "gi"  'magit-init
    "gl"  'magit-log-buffer-file
    "gm"  'magit-dispatch
    "gs"  'magit-status
    "gS"  'magit-stage-file
    "gU"  'magit-unstage-file
    )
  (despot-def '(magit-status-mode-map)
    :major-modes '(magit-status-mode)
    "b"  'magit-blame
    "c"  'magit-commit
    "d"  'magit-diff
    )
  )

(use-package forge
  :after magit
  :init  (setq	 auth-sources '("~/.authinfo.gpg")
                 forge-database-connector 'sqlite-builtin
                 )
  )

(use-package transient
  :after vc magit
  :general
  (general-def transient-base-map   "q" 'transient-quit-one)
  (general-def transient-sticky-map "q" 'transient-quit-seq)
  )

(use-package browse-at-remote
  :after vc magit
  :general
  (tyrant-def "go" 'browse-at-remote)
  )

(use-package diff-hl
  :after vc magit
  :hook (magit-pre-refresh . diff-hl-magit-pre-refresh)
        (magit-post-refresh . diff-hl-magit-post-refresh)
  :custom (global-diff-hl-mode 1)
  :config (setopt diff-hl-side 'right)
  :general
  (general-def 'normal
    "[ h" '(diff-hl-previous-hunk :jump t)
    "] h" '(diff-hl-next-hunk :jump t))
  )

(use-package git-modes
  :mode ("\\.gitignore\\\'" . gitignore-mode)
  :after vc magit)

(use-package git-link
  :after vc magit
  :config (setopt git-link-open-in-browser t)
  :general
  (tyrant-def
    "gL"  (cons "links" (make-sparse-keymap))
    "gLc" 'git-link-commit
    "gLC" 'git-link-commit-copy-url-only
    "gLl" 'git-link
    "gLL" 'git-link-copy-url-only
    "gLh" 'git-link-homepage)
  )

(use-package git-cliff
	:disabled
	:config
	(with-eval-after-load 'magit-tag
		(transient-append-suffix 'magit-tag
			'(1 0 -1)
			'("c" "changelog" git-cliff-menu)))
	:general
	(despot-def '(magit-status-mode-map)
		:major-modes '(magit-status-mode)
    "C"  'git-cliff-menu
		)
	)

(use-package gitignore-templates
  :after vc magit
  :config
  (setq gitignore-templates-api 'github)
  :general
  (tyrant-def
    "gI"  (cons "gitignore" (make-sparse-keymap))
    "gIn" 'gitignore-templates-new-file
    "gIi" 'gitignore-templates-insert)
  )

(use-package magit-todos
  :after magit
  :config (magit-todos-mode 1)
  )

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-vc.el ends here
#+end_src

