its-lit.org
** setup-web.el
:PROPERTIES:
:CUSTOM_ID: setup-webel
:END:
#+begin_src emacs-lisp :tangle config/setup-web.el
;;; config/setup-web.el --- Web development configuration -*- lexical-binding: t -*-

(use-package ox-hugo
	:disabled
	)

(use-package easy-hugo
	:disabled
  :init
  (setq
   easy-hugo-basedir "~/code/website/jsperger-hugo/"
	 easy-hugo-url "https://jsperger.github.io"
	 )
	:config
	(setopt
	 easy-hugo-no-help t
	 )
	(easy-hugo-enable-menu)
	:general
	(tyrant-def "ah" 'easy-hugo-menu)
	)

(use-package htmlize)

(use-package verb
	:disabled
	)

;;; setup-web.el ends here

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
#+end_src

** setup-writing.el
:PROPERTIES:
:CUSTOM_ID: setup-writingel
:END:
#+begin_src emacs-lisp :tangle config/setup-writing.el
;;; config/setup-writing.el --- Writing tools configuration -*- lexical-binding: t -*-

(use-package binder
	:general
	(tyrant-def
		"t;" 'binder-toggle-sidebar
		"t'"  'binder-reveal-in-sidebar
		"[" 'binder-previous
		"]" 'binder-next)
	)

(use-package flymake-proselint
  :disabled)

(use-package flymake-vale
	:ensure (flymake-vale :host github :repo "tpeacock19/flymake-vale")
	:general
	(tyrant-def
		"as" 'flymake-vale-load))

(use-package jinx
  :after evil
  :hook (text-mode . jinx-mode)
  :config
  (add-to-list 'jinx-exclude-regexps '(t "\\cc"))
  (add-to-list 'jinx-exclude-regexps '(LaTeX-mode "\\s*\\input{[^}]+}\\s*"))

  (add-to-list 'jinx-camel-modes 'R-mode)
  (add-to-list 'jinx-camel-modes 'ess-r-mode)

  (with-eval-after-load 'vertico-multiform
    (add-to-list 'vertico-multiform-categories '(jinx grid (vertico-grid-annotate . 20))))
  (with-eval-after-load 'evil
    (evil-define-motion evil-prev-jinx-error (count)
      "Go to the COUNT'th spelling mistake preceding point."
      :jump t (jinx-previous (or count 1)))
    (evil-define-motion evil-next-jinx-error (count)
      "Go to the COUNT'th spelling mistake after point."
      :jump t (jinx-next (or count 1))))
  :general
  ([remap ispell-word] 'jinx-correct-word
   [remap evil-prev-flyspell-error] 'evil-prev-jinx-error
   [remap evil-next-flyspell-error] 'evil-next-jinx-error))

(use-package freeze-it
	:disabled
	)

(use-package unfill
	:general
	(general-def '(normal visual) text-mode-map
		"g=" 'unfill-region
		"g+" 'unfill-paragraph
		"t+" 'unfill-toggle)
	)

(use-package pandoc-mode
	:disabled
  :hook (pandoc-mode . pandoc-load-default-settings)
  :commands pandoc
  :config
  (defun pandoc ()
  "Start pandoc for the buffer and open the menu"
  (interactive)
  (if (not (bound-and-true-p pandoc-mode)) (pandoc-mode))
  (pandoc-main-hydra/body))

)

(use-package ox-typst
	:disabled
  :after org
	:config
	(defvar org-typst-math-use-typst-syntax t)
	(if org-typst-math-use-typst-syntax
		(setq org-typst-from-latex-environment #'org-typst-from-latex-with-naive
					org-typst-from-latex-fragment #'org-typst-from-latex-with-naive)
(setq org-typst-from-latex-environment #'org-typst-from-latex-with-pandoc
      org-typst-from-latex-fragment #'org-typst-from-latex-with-pandoc)
		)
	)

(use-package writegood-mode
	:disabled
	)

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
;;; setup-writing.el ends here
#+end_src

* Lisp functions
:PROPERTIES:
:CUSTOM_ID: lisp-functions
:LAST_MODIFIED: [2025-07-15 Tue 22:30]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
