its-lit.org
** my-core-helpers.el
:PROPERTIES:
:CUSTOM_ID: my-core-helpersel
:LAST_MODIFIED: [2025-07-18 Fri 21:39]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle lisp/my-core-helpers.el
;;; my-core-helpers.el --- Helper functions for core config -*- lexical-binding: t -*-

(defun system-move-file-to-trash (file)
  "Use \"trash\" to move FILE to the system trash."
  (cl-assert (executable-find "trash") nil "'trash' must be installed. Needs \"brew install trash\"")
  (call-process "trash" nil 0 nil "-F"  file))

(defun server-remove-kill-buffer-hook ()
  "Remove prompt if the file is opened in other clients."
  (remove-hook 'kill-buffer-query-functions 'server-kill-buffer-query-function))

(defun desktop-read@inhibit-message (fn)
  "Inhibit `desktop-read' message"
  (let ((inhibit-message t))
    (funcall fn)))

(defun check-large-file ()
  "Check when opening large files - literal file open."
  (let* ((filename (buffer-file-name))
         (size (nth 7 (file-attributes filename))))
    (when (and
           (not (memq major-mode
                      '(archive-mode doc-view-mode doc-view-mode-maybe
                                     ebrowse-tree-mode emacs-lisp-mode
                                     fundamental-mode git-commit-mode
                                     image-mode jka-compr pdf-view-mode
                                     tags-table-mode tar-mode)))
           size (> size (* 1024 1024 20))
           (y-or-n-p (format (concat "%s is a large file, open literally to "
                                     "avoid performance issues?")
                             filename)))
      (setopt buffer-read-only t)
      (buffer-disable-undo)
      (fundamental-mode))))

(defun make-directory-maybe ()
  "Create parent directory if not exists while visiting file."
  (let ((dir (file-name-directory buffer-file-name)))
    (unless (file-exists-p dir)
      (if (y-or-n-p (format "Directory %s does not exist,do you want you create it? " dir))
          (make-directory dir t)
        (keyboard-quit)))))

(defun comment-or-uncomment (n)
  (interactive "*p")
  (if (or (region-active-p)
          (save-excursion
            (beginning-of-line)
            (looking-at "\\s-*$")))
      (call-interactively 'comment-dwim)
    (comment-or-uncomment-region
     (line-beginning-position) (line-end-position n))))

(defcustom project-root-files '(".project")
  "Files that indicate the root of a project."
  :group 'project
  :type '(repeat string))

(defun project-try-root (dir)
  "Search up the `DIR' for `project-root-files'."
  (when-let* ((root
              (seq-some
               (lambda (n) (locate-dominating-file dir n))
               project-root-files)))
    (cons 'transient (expand-file-name root))))

(defun savehist-unpropertize-variables-h ()
  "Remove text properties from `kill-ring' to reduce savehist cache size."
  (setq kill-ring
        (mapcar #'substring-no-properties
                (cl-remove-if-not #'stringp kill-ring))
        register-alist
        (cl-loop for (reg . item) in register-alist
                 if (stringp item)
                 collect (cons reg (substring-no-properties item))
                 else collect (cons reg item))))

(defun savehist-remove-unprintable-registers-h ()
  "Remove unwriteable registers (e.g. containing window configurations).
Otherwise, `savehist' would discard `register-alist' entirely if we don't omit
the unwritable tidbits."
  ;; Save new value in the temp buffer savehist is running
  ;; `savehist-save-hook' in. We don't want to actually remove the
  ;; unserializable registers in the current session!
  (setq-local register-alist
              (cl-remove-if-not #'savehist-printable register-alist)))

(provide 'my-core-helpers)
;;; my-core-helpers.el ends here
#+end_src

** my-editor-helpers.el
:PROPERTIES:
:CUSTOM_ID: my-editor-helpersel
:LAST_MODIFIED: [2025-07-18 Fri 21:39]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle lisp/my-editor-helpers.el
;;; my-editor-helpers.el --- Helper functions for editor -*- lexical-binding: t -*-

(defun helpful-reuse-window (buffer-or-name)
  "Switch to helpful BUFFER-OR-NAME.

The logic is simple, if we are currently in the helpful buffer,
reuse it's window, otherwise create new one."
  (if (eq major-mode 'helpful-mode)
      (pop-to-buffer-same-window buffer-or-name)
    (pop-to-buffer buffer-or-name)))

(defun move-buffer-to-window (windownum follow-focus-p)
  "Moves a buffer to a window. follow-focus-p controls
whether focus moves to new window (with buffer), or stays on current"
  (interactive)
  (let ((b (current-buffer))
        (w1 (selected-window))
        (w2 (winum-get-window-by-number windownum)))
    (unless (eq w1 w2)
      (set-window-buffer w2 b)
      (switch-to-prev-buffer)
      (unrecord-window-buffer w1 b)))
  (when follow-focus-p (select-window (winum-get-window-by-number windownum))))

(defun swap-buffers-to-window (windownum follow-focus-p)
  "Swaps visible buffers between active window and selected window.
follow-focus-p controls whether focus moves to new window (with buffer), or
stays on current"
  (interactive)
  (let* ((b1 (current-buffer))
         (w1 (selected-window))
         (w2 (winum-get-window-by-number windownum))
         (b2 (window-buffer w2)))
    (unless (eq w1 w2)
      (set-window-buffer w1 b2)
      (set-window-buffer w2 b1)
      (unrecord-window-buffer w1 b1)
      (unrecord-window-buffer w2 b2)))
  (when follow-focus-p (winum-select-window-by-number windownum)))

(provide 'my-editor-helpers)
;;; my-editor-helpers.el ends here
#+end_src

** my-keybinding-helpers.el
:PROPERTIES:
:CUSTOM_ID: my-keybinding-helpersel
:LAST_MODIFIED: [2025-07-18 Fri 21:39]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle lisp/my-keybinding-helpers.el
;;; my-keybinding-helpers.el --- Keybinding helper functions -*- lexical-binding: t -*-

(defun my-view-leader-keys ()
  "Display all keybindings defined in the `tyrant-map`.
This provides a consolidated view of all global leader keys."
  (interactive)
  (describe-keymap 'tyrant-map)
  )

(provide 'my-keybinding-helpers)
;;; my-keybinding-helpers.el ends here
#+end_src

** my-lang-helpers.el
:PROPERTIES:
:CUSTOM_ID: my-lang-helpersel
:LAST_MODIFIED: [2025-07-18 Fri 21:39]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle lisp/my-lang-helpers.el
;;; my-lang-helpers.el --- Language helper functions -*- lexical-binding: t -*-

; ================================== R ================================== ;
(defun oc-set-ess-offset-indent ()
  "Set ess-offset-arguments values to my preferred defaults. Motivated by an Org src block issue (that  is likely due to a config issue on my end)."
  (interactive)
  (setopt
   ess-offset-arguments 'prev-call
   ess-offset-arguments-newline 'prev-line)
  )

(defun air-format-dir ()
  "Run the 'air' formatter in the current directory asynchronously"
  (interactive)
  (async-shell-command "air format .")
  )

(defun air-format-file ()
  "Run the 'air format' shell command on the current buffer's file."
  (interactive)
  (let ((filename (buffer-file-name)))
    (if filename
        (progn
          ;; Save the buffer before formatting to ensure changes are read by 'air'
          (save-buffer)
          (async-shell-command
           (format "air format %s" (shell-quote-argument filename)))
          (message "Running 'air format' on %s..." filename))
      (message "Buffer is not visiting a file.")))
  )


; ================================ LaTeX ================================
(defun replace-double-dollar-math ()
  "Replace display math $$...$$ with \[...\] in the current buffer. Double dollar signs should no longer be used in LaTeX."
  (interactive)
  (goto-char (point-min))
  (while (re-search-forward "\\$\$\(.*?\)\\$\$" nil t)
    (replace-match "\\[\\1\\]" nil nil))
  )


(provide 'my-lang-helpers)
;;; my-lang-helpers.el ends here
#+end_src

