its-lit.org
** my-lsp-bridge-helpers.el
:PROPERTIES:
:CUSTOM_ID: my-lsp-bridge-helpersel
:LAST_MODIFIED: [2025-07-18 Fri 21:39]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle lisp/my-lsp-bridge-helpers.el
;;; my-lsp-bridge-helpers.el --- Helper functions for lsp-bridge -*- lexical-binding: t -*-

(defvar lsp-bridge-venv-path
	(no-littering-expand-var-file-name "lsp-bridge-env")
  "Path to the virtual environment for lsp-bridge.")

(defvar lsp-bridge-python-path
	(expand-file-name "bin/python" lsp-bridge-venv-path)
  "Path to the python executable in the virtual environment for lsp-bridge.")

(defun setup-lsp-bridge-env (venv-path)
  "Set up a Python virtual environment at VENV-PATH with required packages."
  (let* ((env-path venv-path))
    (unless (file-exists-p (file-name-directory env-path))
      (make-directory (file-name-directory env-path) t))

    (unless (file-directory-p env-path)
      (message "Creating virtual environment at %s" env-path)
      (shell-command (format "%s -m venv %s"
                             (executable-find "python3")
                             (shell-quote-argument env-path))))

    (let ((activate-script (expand-file-name "bin/activate_this.py" env-path)))
      (when (file-exists-p activate-script)
        (load activate-script t t)

        (message "Installing/updating required Python packages...")
        (dolist (package '("epc" "orjson" "sexpdata" "six" "setuptools" "paramiko"
                           "rapidfuzz" "watchdog" "packaging"))
          (shell-command (format "%s install --upgrade %s"
                                 (executable-find "pip3")
                                 package)))

        (deactivate-virtualenv)))))

(provide 'my-lsp-bridge-helpers)
;;; my-lsp-bridge-helpers.el ends here
#+end_src

** my-org-helpers.el
:PROPERTIES:
:CUSTOM_ID: my-org-helpersel
:LAST_MODIFIED: [2025-07-18 Fri 21:39]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle lisp/my-org-helpers.el
;;; my-org-helpers.el --- Helper functions for org-mode -*- lexical-binding: t -*-

(defun my/org-toggle-hidden-emphasis-markers ()
  "Toggle whether markup should be hidden in 'org-mode'."
  (interactive)
  (if org-hide-emphasis-markers
      (setopt org-hide-emphasis-markers nil)
    (setopt org-hide-emphasis-markers t)
    )
  (font-lock-update)
  )

(defun my/org-import-directory-as-tangled-blocks (dir-name)
  "Import all .el files from a specified directory into Org source blocks.
The target directory DIR-NAME is relative to `user-emacs-directory`.
The generated blocks are inserted into the current buffer. Each
file is placed under its own headline inside a source block with a
corresponding ':tangle' header argument."
  (interactive "sEnter directory name (e.g., lisp, config): ")
  (let* ((target-dir (expand-file-name dir-name user-emacs-directory))
         (el-files (directory-files target-dir t "\\.el$")))
    (if (not el-files)
        (message "No .el files found in %s" target-dir)
      (dolist (file-path (sort el-files #'string-lessp))
        (let* ((file-name (file-name-nondirectory file-path))
               (tangle-path (concat dir-name "/" file-name))
               (file-contents (with-temp-buffer
                                (insert-file-contents file-path)
                                (buffer-string))))
          (insert (format "** %s\n" file-name))
          (insert (format "#+begin_src emacs-lisp :tangle %s\n" tangle-path))
          (insert file-contents)
          (unless (string-suffix-p "\n" file-contents)
            (insert "\n"))
          (insert "#+end_src\n\n"))))))
(defun my/org-update-subtree-modification-info ()
  "Update modification info in the current subtree's properties.
Sets 'LAST_MODIFIED' timestamp and 'MODIFIED_WITH_EMACS' version.
Intended for `before-save-hook` in an Org mode buffer."
 (when (derived-mode-p 'org-mode)
    (save-excursion
      (org-back-to-heading t)
      (let* ((emacs-full-version (emacs-version))
             (emacs-version-short (car (split-string emacs-full-version " ("))))
        ;; Set the last modified timestamp. Using `nil` as the first
        ;; argument correctly finds the current entry's property drawer.
        (org-entry-put nil "LAST_MODIFIED"
                       (format-time-string "[%Y-%m-%d %a %H:%M]"))
        ;; Set the Emacs version in the same property drawer.
        (org-entry-put nil "MODIFIED_WITH_EMACS" emacs-version-short))))
 )
(provide 'my-org-helpers)
;;; my-org-helpers.el ends here
#+end_src

** my-theme-helpers.el
:PROPERTIES:
:CUSTOM_ID: my-theme-helpersel
:LAST_MODIFIED: [2025-07-18 Fri 21:40]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
#+begin_src emacs-lisp :tangle lisp/my-theme-helpers.el
;;; my-theme-helpers.el --- Helper functions for themes -*- lexical-binding: t -*-

(defvar after-load-theme-hook nil
  "Hook run after a color theme is loaded using `load-theme'.")

(defun load-theme@run-hooks (&rest _)
  "Run `after-load-theme-hook'."
  (run-hooks 'after-load-theme-hook))

(defun load-theme@theme-dont-propagate (&rest _)
  "Discard all themes before loading new."
  (mapc #'disable-theme custom-enabled-themes))

(defun bolder-faces ()
  (set-face-attribute 'font-lock-function-name-face nil :weight 'semi-bold)
  (set-face-attribute 'font-lock-keyword-face nil :weight 'semi-bold))

(defun customize-tab-bar ()
  "Customize tab-bar faces."
  (set-face-attribute 'tab-bar nil
                      :foreground 'unspecified
                      :background 'unspecified
                      :box `(:line-width (-1 . 4) :color ,(face-background 'default))
                      :inherit 'unspecified)
  (set-face-attribute 'tab-bar-tab nil
                      :weight 'bold
                      :box 'unspecified
                      :foreground 'unspecified
                      :background 'unspecified
                      :inherit 'unspecified)
  (set-face-attribute 'tab-bar-tab-inactive nil
                      :box 'unspecified
                      :foreground 'unspecified
                      :background 'unspecified
                      :inherit 'unspecified))

(defun unscale-outlines ()
  (dolist (outline-number (number-sequence 1 8))
    (let ((outline (intern (format "outline-%d" outline-number))))
      (set-face-attribute outline nil :height 1.0))))

(defun my-disable-flymake-underline ()
  "Disable underlining for Flymake faces while keeping theme colors."
  (custom-set-faces
   `(flymake-error ((t (:underline nil :inherit default))))
   `(flymake-note ((t (:underline nil :inherit default))))
   `(flymake-warning ((t (:underline nil :inherit default))))))

(provide 'my-theme-helpers)
;;; my-theme-helpers.el ends here
#+end_src

** my-vc-helpers.el
:PROPERTIES:
:LAST_MODIFIED: [2025-07-18 Fri 21:40]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:CUSTOM_ID: my-vc-helpersel
:END:
#+begin_src emacs-lisp :tangle lisp/my-vc-helpers.el
;;; my-vc-helpers.el --- Helper functions for version control -*- lexical-binding: t -*-

(defun org-reveal-advice (&rest _args)
  "Unfold the org headings for a target line.
This can be used to advice functions that might open .org files.

For example: To unfold from a magit diff buffer, evaluate the following:
(advice-add 'magit-diff-visit-file :after #'org-reveal-advice)"
  (when (derived-mode-p 'org-mode) (org-reveal))
  )

(defun git-link-copy-url-only ()
  "Only copy the generated link to the kill ring."
  (interactive)
  (let (git-link-open-in-browser)
    (call-interactively 'git-link)))

(defun git-link-commit-copy-url-only ()
  "Only copy the generated link to the kill ring."
  (interactive)
  (let (git-link-open-in-browser)
    (call-interactively 'git-link-commit)))

(provide 'my-vc-helpers)
;;; my-vc-helpers.el ends here
#+end_src
* Appendices
:PROPERTIES:
:CUSTOM_ID: appendices
:LAST_MODIFIED: [2025-07-16 Wed 23:31]
:MODIFIED_WITH_EMACS: GNU Emacs 31.0.50
:END:
## Local Variables:
## eval: (add-hook 'before-save-hook #'org-make-toc nil t)
## eval: (add-hook 'before-save-hook #'my/org-update-subtree-modification-info)
## End:
